garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
// Generated 24/03/2025 GMT

/*
 * Copyright © 2025, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F45Q24_H_
#define _PIC18F45Q24_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F45Q24
 */
#ifndef _XC_H_
#warning Header file pic18f45q24.h included directly. Use #include <xc.h> instead.
#endif

/*
 * Interrupt Source IRQ numbers
 */

// Software Interrupt
#define                                 IRQ_SW              0
// HLVD Interrupt
#define                                 IRQ_HLVD            1
// Oscillator Failure Interrupt
#define                                 IRQ_OSF             2
// Clock Switch Interrupt
#define                                 IRQ_CSW             3
// NVM Interrupt
#define                                 IRQ_NVM             4
// CLC1 Interrupt
#define                                 IRQ_CLC1            5
// CRC Interrupt
#define                                 IRQ_CRC             6
// Interrupt on change
#define                                 IRQ_IOC             7
// External Interrupt 0
#define                                 IRQ_INT0            8
// ADC Threshold Interrupt-Context 0
#define                                 IRQ_ADT             9
// ADC Interrupt
#define                                 IRQ_AD              10
// Active Clock Tuning Interrupt
#define                                 IRQ_ACT             11
// I2C1 Receive Interrupt
#define                                 IRQ_I2C2RX          12
// I2C1 Transmit Interrupt
#define                                 IRQ_I2C2TX          13
// I2C1 Interrupt
#define                                 IRQ_I2C2            14
// I2C1 Error Interrupt
#define                                 IRQ_I2C2E           15
// ZCD2 Interrupt
#define                                 IRQ_ZCD2            16
// CLC5 Interrupt
#define                                 IRQ_CLC5            17
// Signal Routing Port Interrupt on Change
#define                                 IRQ_IOCSR           18
// ZCD1 Interrupt
#define                                 IRQ_ZCD1            19
// DMA1 Source count Interrupt
#define                                 IRQ_DMA1SCNT        20
// DMA1 Destination count Interrupt
#define                                 IRQ_DMA1DCNT        21
// DMA1 Overflow Interrupt
#define                                 IRQ_DMA1OR          22
// DMA1 Abort Interrupt
#define                                 IRQ_DMA1A           23
// SPI1 Receive Interrupt
#define                                 IRQ_SPI1RX          24
// SPI1 Transmit Interrupt
#define                                 IRQ_SPI1TX          25
// SPI1 Interrupt
#define                                 IRQ_SPI1            26
// Timer2 Interrupt
#define                                 IRQ_TMR2            27
// Timer1 Interrupt
#define                                 IRQ_TMR1            28
// Timer1 Gate Interrupt
#define                                 IRQ_TMR1G           29
// CCP1 Interrupt
#define                                 IRQ_CCP1            30
// Timer0 Interrupt
#define                                 IRQ_TMR0            31
// UART1 Receive Interrupt
#define                                 IRQ_U1RX            32
// UART1 Transmit Interrupt
#define                                 IRQ_U1TX            33
// UART1 Error Interrupt
#define                                 IRQ_U1E             34
// UART1 Interrupt
#define                                 IRQ_U1              35
// Timer3 Interrupt
#define                                 IRQ_TMR3            36
// Timer3 Gate Interrupt
#define                                 IRQ_TMR3G           37
// PWM1 Period Interrupt
#define                                 IRQ_PWM1PR          38
// PWM1 Interrupt
#define                                 IRQ_PWM1            39
// CLC6 Interrupt
#define                                 IRQ_CLC6            41
// Universal Timer 16A Interrupt
#define                                 IRQ_TU16A           42
// Timer6 Interrupt
#define                                 IRQ_TMR6            43
// Comparator 2 Interrupt
#define                                 IRQ_CMP2            44
// CLC2 Interrupt
#define                                 IRQ_CLC2            45
// PWM2 Period Interrupt
#define                                 IRQ_PWM2PR          46
// PWM2 Interrupt
#define                                 IRQ_PWM2            47
// External Interrupt 1
#define                                 IRQ_INT1            48
// CLC7 Interrupt
#define                                 IRQ_CLC7            49
// CWG1 Interrupt
#define                                 IRQ_CWG1            50
// NCO1 Interrupt
#define                                 IRQ_NCO1            51
// DMA2 Source count Interrupt
#define                                 IRQ_DMA2SCNT        52
// DMA2 Destination count Interrupt
#define                                 IRQ_DMA2DCNT        53
// DMA2 Overflow Interrupt
#define                                 IRQ_DMA2OR          54
// DMA2 Abort Interrupt
#define                                 IRQ_DMA2A           55
// I2C1 Receive Interrupt
#define                                 IRQ_I2C1RX          56
// I2C1 Transmit Interrupt
#define                                 IRQ_I2C1TX          57
// I2C1 Interrupt
#define                                 IRQ_I2C1            58
// I2C1 Error Interrupt
#define                                 IRQ_I2C1E           59
// CLC3 Interrupt
#define                                 IRQ_CLC3            61
// PWM3 Period Interrupt
#define                                 IRQ_PWM3PR          62
// PWM3 Interrupt
#define                                 IRQ_PWM3            63
// UART2 Receive Interrupt
#define                                 IRQ_U2RX            64
// UART2 Transmit Interrupt
#define                                 IRQ_U2TX            65
// UART2 Error Interrupt
#define                                 IRQ_U2E             66
// UART2 Interrupt
#define                                 IRQ_U2              67
// CLC4 Interrupt
#define                                 IRQ_CLC4            69
// CCP2 Interrupt
#define                                 IRQ_CCP2            70
// Scanner Interrupt
#define                                 IRQ_SCAN            71
// Comparator 1 Interrupt
#define                                 IRQ_CMP1            72
// DMA3 Source count Interrupt
#define                                 IRQ_DMA3SCNT        76
// DMA3 Destination count Interrupt
#define                                 IRQ_DMA3DCNT        77
// DMA3 Overflow Interrupt
#define                                 IRQ_DMA3OR          78
// DMA3 Abort Interrupt
#define                                 IRQ_DMA3A           79
// External Interrupt 2
#define                                 IRQ_INT2            80
// CLC8 Interrupt
#define                                 IRQ_CLC8            81
// Universal Timer 16B Interrupt
#define                                 IRQ_TU16B           82
// Timer4 Interrupt
#define                                 IRQ_TMR4            83
// DMA4 Source count Interrupt
#define                                 IRQ_DMA4SCNT        84
// DMA4 Destination count Interrupt
#define                                 IRQ_DMA4DCNT        85
// DMA4 Overflow Interrupt
#define                                 IRQ_DMA4OR          86
// DMA4 Abort Interrupt
#define                                 IRQ_DMA4A           87
// SPI2 Receive Interrupt
#define                                 IRQ_SPI2RX          88
// SPI2 Transmit Interrupt
#define                                 IRQ_SPI2TX          89
// SPI2 Interrupt
#define                                 IRQ_SPI2            90
// VDDIO2 Low Voltage Detect Trip Point Interrupt
#define                                 IRQ_VDDIO2LVD       91
// VDDIO2 Status Ready Interrupt
#define                                 IRQ_VDDIO2RDY       92
// VDDIO2 Power on Reset Interrupt
#define                                 IRQ_VDDIO2POR       93
/*
 * Register Definitions
 */

// Register: ICSPLOCK
#define ICSPLOCK ICSPLOCK
extern volatile unsigned char           ICSPLOCK            __at(0x038);
#ifndef _LIB_BUILD
asm("ICSPLOCK equ 038h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LOCK                   :8;
    };
} ICSPLOCKbits_t;
extern volatile ICSPLOCKbits_t ICSPLOCKbits __at(0x038);
// bitfield macros
#define _ICSPLOCK_LOCK_POSN                                 0x0
#define _ICSPLOCK_LOCK_POSITION                             0x0
#define _ICSPLOCK_LOCK_SIZE                                 0x8
#define _ICSPLOCK_LOCK_LENGTH                               0x8
#define _ICSPLOCK_LOCK_MASK                                 0xFF

// Register: ICSPEN
#define ICSPEN ICSPEN
extern volatile unsigned char           ICSPEN              __at(0x039);
#ifndef _LIB_BUILD
asm("ICSPEN equ 039h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EN                     :1;
    };
} ICSPENbits_t;
