garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
// Register: ZCD1CON
#define ZCD1CON ZCD1CON
extern volatile unsigned char           ZCD1CON             __at(0x04C);
#ifndef _LIB_BUILD
asm("ZCD1CON equ 04Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCD1INTN               :1;
        unsigned ZCD1INTP               :1;
        unsigned                        :2;
        unsigned ZCD1POL                :1;
        unsigned ZCD1OUT                :1;
        unsigned                        :1;
        unsigned ZCD1EN                 :1;
    };
} ZCD1CONbits_t;
extern volatile ZCD1CONbits_t ZCD1CONbits __at(0x04C);
// bitfield macros
#define _ZCD1CON_ZCD1INTN_POSN                              0x0
#define _ZCD1CON_ZCD1INTN_POSITION                          0x0
#define _ZCD1CON_ZCD1INTN_SIZE                              0x1
#define _ZCD1CON_ZCD1INTN_LENGTH                            0x1
#define _ZCD1CON_ZCD1INTN_MASK                              0x1
#define _ZCD1CON_ZCD1INTP_POSN                              0x1
#define _ZCD1CON_ZCD1INTP_POSITION                          0x1
#define _ZCD1CON_ZCD1INTP_SIZE                              0x1
#define _ZCD1CON_ZCD1INTP_LENGTH                            0x1
#define _ZCD1CON_ZCD1INTP_MASK                              0x2
#define _ZCD1CON_ZCD1POL_POSN                               0x4
#define _ZCD1CON_ZCD1POL_POSITION                           0x4
#define _ZCD1CON_ZCD1POL_SIZE                               0x1
#define _ZCD1CON_ZCD1POL_LENGTH                             0x1
#define _ZCD1CON_ZCD1POL_MASK                               0x10
#define _ZCD1CON_ZCD1OUT_POSN                               0x5
#define _ZCD1CON_ZCD1OUT_POSITION                           0x5
#define _ZCD1CON_ZCD1OUT_SIZE                               0x1
#define _ZCD1CON_ZCD1OUT_LENGTH                             0x1
#define _ZCD1CON_ZCD1OUT_MASK                               0x20
#define _ZCD1CON_ZCD1EN_POSN                                0x7
#define _ZCD1CON_ZCD1EN_POSITION                            0x7
#define _ZCD1CON_ZCD1EN_SIZE                                0x1
#define _ZCD1CON_ZCD1EN_LENGTH                              0x1
#define _ZCD1CON_ZCD1EN_MASK                                0x80

// Register: ZCD2CON
#define ZCD2CON ZCD2CON
extern volatile unsigned char           ZCD2CON             __at(0x04D);
#ifndef _LIB_BUILD
asm("ZCD2CON equ 04Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCD2INTN               :1;
        unsigned ZCD2INTP               :1;
        unsigned                        :2;
        unsigned ZCD2POL                :1;
        unsigned ZCD2OUT                :1;
        unsigned                        :1;
        unsigned ZCD2EN                 :1;
    };
} ZCD2CONbits_t;
extern volatile ZCD2CONbits_t ZCD2CONbits __at(0x04D);
// bitfield macros
#define _ZCD2CON_ZCD2INTN_POSN                              0x0
#define _ZCD2CON_ZCD2INTN_POSITION                          0x0
#define _ZCD2CON_ZCD2INTN_SIZE                              0x1
#define _ZCD2CON_ZCD2INTN_LENGTH                            0x1
#define _ZCD2CON_ZCD2INTN_MASK                              0x1
#define _ZCD2CON_ZCD2INTP_POSN                              0x1
#define _ZCD2CON_ZCD2INTP_POSITION                          0x1
#define _ZCD2CON_ZCD2INTP_SIZE                              0x1
#define _ZCD2CON_ZCD2INTP_LENGTH                            0x1
#define _ZCD2CON_ZCD2INTP_MASK                              0x2
#define _ZCD2CON_ZCD2POL_POSN                               0x4
#define _ZCD2CON_ZCD2POL_POSITION                           0x4
#define _ZCD2CON_ZCD2POL_SIZE                               0x1
#define _ZCD2CON_ZCD2POL_LENGTH                             0x1
#define _ZCD2CON_ZCD2POL_MASK                               0x10
#define _ZCD2CON_ZCD2OUT_POSN                               0x5
#define _ZCD2CON_ZCD2OUT_POSITION                           0x5
#define _ZCD2CON_ZCD2OUT_SIZE                               0x1
#define _ZCD2CON_ZCD2OUT_LENGTH                             0x1
#define _ZCD2CON_ZCD2OUT_MASK                               0x20
#define _ZCD2CON_ZCD2EN_POSN                                0x7
#define _ZCD2CON_ZCD2EN_POSITION                            0x7
#define _ZCD2CON_ZCD2EN_SIZE                                0x1
#define _ZCD2CON_ZCD2EN_LENGTH                              0x1
#define _ZCD2CON_ZCD2EN_MASK                                0x80

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0x062);
#ifndef _LIB_BUILD
asm("PMD0 equ 062h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCMD                  :1;
        unsigned CLKRMD                 :1;
        unsigned                        :1;
        unsigned SCANMD                 :1;
        unsigned CRCMD                  :1;
        unsigned HLVDMD                 :1;
        unsigned FVRMD                  :1;
        unsigned SYSCMD                 :1;
    };
    struct {
        unsigned                        :5;
        unsigned LVDMD                  :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0x062);
// bitfield macros
#define _PMD0_IOCMD_POSN                                    0x0
#define _PMD0_IOCMD_POSITION                                0x0
#define _PMD0_IOCMD_SIZE                                    0x1
#define _PMD0_IOCMD_LENGTH                                  0x1
#define _PMD0_IOCMD_MASK                                    0x1
#define _PMD0_CLKRMD_POSN                                   0x1
#define _PMD0_CLKRMD_POSITION                               0x1
#define _PMD0_CLKRMD_SIZE                                   0x1
#define _PMD0_CLKRMD_LENGTH                                 0x1
#define _PMD0_CLKRMD_MASK                                   0x2
#define _PMD0_SCANMD_POSN                                   0x3
#define _PMD0_SCANMD_POSITION                               0x3
#define _PMD0_SCANMD_SIZE                                   0x1
#define _PMD0_SCANMD_LENGTH                                 0x1
#define _PMD0_SCANMD_MASK                                   0x8
#define _PMD0_CRCMD_POSN                                    0x4
#define _PMD0_CRCMD_POSITION                                0x4
#define _PMD0_CRCMD_SIZE                                    0x1
#define _PMD0_CRCMD_LENGTH                                  0x1
#define _PMD0_CRCMD_MASK                                    0x10
#define _PMD0_HLVDMD_POSN                                   0x5
#define _PMD0_HLVDMD_POSITION                               0x5
#define _PMD0_HLVDMD_SIZE                                   0x1
#define _PMD0_HLVDMD_LENGTH                                 0x1
#define _PMD0_HLVDMD_MASK                                   0x20
#define _PMD0_FVRMD_POSN                                    0x6
#define _PMD0_FVRMD_POSITION                                0x6
#define _PMD0_FVRMD_SIZE                                    0x1
#define _PMD0_FVRMD_LENGTH                                  0x1
#define _PMD0_FVRMD_MASK                                    0x40
#define _PMD0_SYSCMD_POSN                                   0x7
#define _PMD0_SYSCMD_POSITION                               0x7
#define _PMD0_SYSCMD_SIZE                                   0x1
#define _PMD0_SYSCMD_LENGTH                                 0x1
#define _PMD0_SYSCMD_MASK                                   0x80
#define _PMD0_LVDMD_POSN                                    0x5
#define _PMD0_LVDMD_POSITION                                0x5
#define _PMD0_LVDMD_SIZE                                    0x1
#define _PMD0_LVDMD_LENGTH                                  0x1
#define _PMD0_LVDMD_MASK                                    0x20

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0x063);
#ifndef _LIB_BUILD
asm("PMD1 equ 063h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0MD                 :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned ZCD1MD                 :1;
        unsigned CM1MD                  :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0x063);
// bitfield macros
#define _PMD1_TMR0MD_POSN                                   0x0
#define _PMD1_TMR0MD_POSITION                               0x0
#define _PMD1_TMR0MD_SIZE                                   0x1
#define _PMD1_TMR0MD_LENGTH                                 0x1
#define _PMD1_TMR0MD_MASK                                   0x1
#define _PMD1_TMR1MD_POSN                                   0x1
#define _PMD1_TMR1MD_POSITION                               0x1
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR3MD_POSN                                   0x3
#define _PMD1_TMR3MD_POSITION                               0x3
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x8
#define _PMD1_TMR4MD_POSN                                   0x4
#define _PMD1_TMR4MD_POSITION                               0x4
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x10
#define _PMD1_TMR6MD_POSN                                   0x5
#define _PMD1_TMR6MD_POSITION                               0x5
#define _PMD1_TMR6MD_SIZE                                   0x1
#define _PMD1_TMR6MD_LENGTH                                 0x1
#define _PMD1_TMR6MD_MASK                                   0x20
#define _PMD1_ZCD1MD_POSN                                   0x6
#define _PMD1_ZCD1MD_POSITION                               0x6
#define _PMD1_ZCD1MD_SIZE                                   0x1
#define _PMD1_ZCD1MD_LENGTH                                 0x1
#define _PMD1_ZCD1MD_MASK                                   0x40
#define _PMD1_CM1MD_POSN                                    0x7
#define _PMD1_CM1MD_POSITION                                0x7
#define _PMD1_CM1MD_SIZE                                    0x1
#define _PMD1_CM1MD_LENGTH                                  0x1
#define _PMD1_CM1MD_MASK                                    0x80

