garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0x064);
#ifndef _LIB_BUILD
asm("PMD2 equ 064h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CM2MD                  :1;
        unsigned ADCMD                  :1;
        unsigned DAC1MD                 :1;
        unsigned ACTMD                  :1;
        unsigned NCO1MD                 :1;
        unsigned CWG1MD                 :1;
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0x064);
// bitfield macros
#define _PMD2_CM2MD_POSN                                    0x0
#define _PMD2_CM2MD_POSITION                                0x0
#define _PMD2_CM2MD_SIZE                                    0x1
#define _PMD2_CM2MD_LENGTH                                  0x1
#define _PMD2_CM2MD_MASK                                    0x1
#define _PMD2_ADCMD_POSN                                    0x1
#define _PMD2_ADCMD_POSITION                                0x1
#define _PMD2_ADCMD_SIZE                                    0x1
#define _PMD2_ADCMD_LENGTH                                  0x1
#define _PMD2_ADCMD_MASK                                    0x2
#define _PMD2_DAC1MD_POSN                                   0x2
#define _PMD2_DAC1MD_POSITION                               0x2
#define _PMD2_DAC1MD_SIZE                                   0x1
#define _PMD2_DAC1MD_LENGTH                                 0x1
#define _PMD2_DAC1MD_MASK                                   0x4
#define _PMD2_ACTMD_POSN                                    0x3
#define _PMD2_ACTMD_POSITION                                0x3
#define _PMD2_ACTMD_SIZE                                    0x1
#define _PMD2_ACTMD_LENGTH                                  0x1
#define _PMD2_ACTMD_MASK                                    0x8
#define _PMD2_NCO1MD_POSN                                   0x4
#define _PMD2_NCO1MD_POSITION                               0x4
#define _PMD2_NCO1MD_SIZE                                   0x1
#define _PMD2_NCO1MD_LENGTH                                 0x1
#define _PMD2_NCO1MD_MASK                                   0x10
#define _PMD2_CWG1MD_POSN                                   0x5
#define _PMD2_CWG1MD_POSITION                               0x5
#define _PMD2_CWG1MD_SIZE                                   0x1
#define _PMD2_CWG1MD_LENGTH                                 0x1
#define _PMD2_CWG1MD_MASK                                   0x20
#define _PMD2_CCP1MD_POSN                                   0x6
#define _PMD2_CCP1MD_POSITION                               0x6
#define _PMD2_CCP1MD_SIZE                                   0x1
#define _PMD2_CCP1MD_LENGTH                                 0x1
#define _PMD2_CCP1MD_MASK                                   0x40
#define _PMD2_CCP2MD_POSN                                   0x7
#define _PMD2_CCP2MD_POSITION                               0x7
#define _PMD2_CCP2MD_SIZE                                   0x1
#define _PMD2_CCP2MD_LENGTH                                 0x1
#define _PMD2_CCP2MD_MASK                                   0x80

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0x065);
#ifndef _LIB_BUILD
asm("PMD3 equ 065h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1MD                 :1;
        unsigned PWM2MD                 :1;
        unsigned PWM3MD                 :1;
        unsigned I2C1MD                 :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
        unsigned U1MD                   :1;
        unsigned U2MD                   :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0x065);
// bitfield macros
#define _PMD3_PWM1MD_POSN                                   0x0
#define _PMD3_PWM1MD_POSITION                               0x0
#define _PMD3_PWM1MD_SIZE                                   0x1
#define _PMD3_PWM1MD_LENGTH                                 0x1
#define _PMD3_PWM1MD_MASK                                   0x1
#define _PMD3_PWM2MD_POSN                                   0x1
#define _PMD3_PWM2MD_POSITION                               0x1
#define _PMD3_PWM2MD_SIZE                                   0x1
#define _PMD3_PWM2MD_LENGTH                                 0x1
#define _PMD3_PWM2MD_MASK                                   0x2
#define _PMD3_PWM3MD_POSN                                   0x2
#define _PMD3_PWM3MD_POSITION                               0x2
#define _PMD3_PWM3MD_SIZE                                   0x1
#define _PMD3_PWM3MD_LENGTH                                 0x1
#define _PMD3_PWM3MD_MASK                                   0x4
#define _PMD3_I2C1MD_POSN                                   0x3
#define _PMD3_I2C1MD_POSITION                               0x3
#define _PMD3_I2C1MD_SIZE                                   0x1
#define _PMD3_I2C1MD_LENGTH                                 0x1
#define _PMD3_I2C1MD_MASK                                   0x8
#define _PMD3_SPI1MD_POSN                                   0x4
#define _PMD3_SPI1MD_POSITION                               0x4
#define _PMD3_SPI1MD_SIZE                                   0x1
#define _PMD3_SPI1MD_LENGTH                                 0x1
#define _PMD3_SPI1MD_MASK                                   0x10
#define _PMD3_SPI2MD_POSN                                   0x5
#define _PMD3_SPI2MD_POSITION                               0x5
#define _PMD3_SPI2MD_SIZE                                   0x1
#define _PMD3_SPI2MD_LENGTH                                 0x1
#define _PMD3_SPI2MD_MASK                                   0x20
#define _PMD3_U1MD_POSN                                     0x6
#define _PMD3_U1MD_POSITION                                 0x6
#define _PMD3_U1MD_SIZE                                     0x1
#define _PMD3_U1MD_LENGTH                                   0x1
#define _PMD3_U1MD_MASK                                     0x40
#define _PMD3_U2MD_POSN                                     0x7
#define _PMD3_U2MD_POSITION                                 0x7
#define _PMD3_U2MD_SIZE                                     0x1
#define _PMD3_U2MD_LENGTH                                   0x1
#define _PMD3_U2MD_MASK                                     0x80

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0x066);
#ifndef _LIB_BUILD
asm("PMD4 equ 066h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2MD                 :1;
        unsigned CLC1MD                 :1;
        unsigned CLC2MD                 :1;
        unsigned CLC3MD                 :1;
        unsigned CLC4MD                 :1;
        unsigned DMA1MD                 :1;
        unsigned DMA2MD                 :1;
        unsigned DMA3MD                 :1;
    };
} PMD4bits_t;
