garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
extern volatile DMAnSSALbits_t DMAnSSALbits __at(0x0F8);
// bitfield macros
#define _DMAnSSAL_SSA_POSN                                  0x0
#define _DMAnSSAL_SSA_POSITION                              0x0
#define _DMAnSSAL_SSA_SIZE                                  0x8
#define _DMAnSSAL_SSA_LENGTH                                0x8
#define _DMAnSSAL_SSA_MASK                                  0xFF
#define _DMAnSSAL_SSA0_POSN                                 0x0
#define _DMAnSSAL_SSA0_POSITION                             0x0
#define _DMAnSSAL_SSA0_SIZE                                 0x1
#define _DMAnSSAL_SSA0_LENGTH                               0x1
#define _DMAnSSAL_SSA0_MASK                                 0x1
#define _DMAnSSAL_SSA1_POSN                                 0x1
#define _DMAnSSAL_SSA1_POSITION                             0x1
#define _DMAnSSAL_SSA1_SIZE                                 0x1
#define _DMAnSSAL_SSA1_LENGTH                               0x1
#define _DMAnSSAL_SSA1_MASK                                 0x2
#define _DMAnSSAL_SSA2_POSN                                 0x2
#define _DMAnSSAL_SSA2_POSITION                             0x2
#define _DMAnSSAL_SSA2_SIZE                                 0x1
#define _DMAnSSAL_SSA2_LENGTH                               0x1
#define _DMAnSSAL_SSA2_MASK                                 0x4
#define _DMAnSSAL_SSA3_POSN                                 0x3
#define _DMAnSSAL_SSA3_POSITION                             0x3
#define _DMAnSSAL_SSA3_SIZE                                 0x1
#define _DMAnSSAL_SSA3_LENGTH                               0x1
#define _DMAnSSAL_SSA3_MASK                                 0x8
#define _DMAnSSAL_SSA4_POSN                                 0x4
#define _DMAnSSAL_SSA4_POSITION                             0x4
#define _DMAnSSAL_SSA4_SIZE                                 0x1
#define _DMAnSSAL_SSA4_LENGTH                               0x1
#define _DMAnSSAL_SSA4_MASK                                 0x10
#define _DMAnSSAL_SSA5_POSN                                 0x5
#define _DMAnSSAL_SSA5_POSITION                             0x5
#define _DMAnSSAL_SSA5_SIZE                                 0x1
#define _DMAnSSAL_SSA5_LENGTH                               0x1
#define _DMAnSSAL_SSA5_MASK                                 0x20
#define _DMAnSSAL_SSA6_POSN                                 0x6
#define _DMAnSSAL_SSA6_POSITION                             0x6
#define _DMAnSSAL_SSA6_SIZE                                 0x1
#define _DMAnSSAL_SSA6_LENGTH                               0x1
#define _DMAnSSAL_SSA6_MASK                                 0x40
#define _DMAnSSAL_SSA7_POSN                                 0x7
#define _DMAnSSAL_SSA7_POSITION                             0x7
#define _DMAnSSAL_SSA7_SIZE                                 0x1
#define _DMAnSSAL_SSA7_LENGTH                               0x1
#define _DMAnSSAL_SSA7_MASK                                 0x80

// Register: DMAnSSAH
#define DMAnSSAH DMAnSSAH
extern volatile unsigned char           DMAnSSAH            __at(0x0F9);
#ifndef _LIB_BUILD
asm("DMAnSSAH equ 0F9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA8                   :1;
        unsigned SSA9                   :1;
        unsigned SSA10                  :1;
        unsigned SSA11                  :1;
        unsigned SSA12                  :1;
        unsigned SSA13                  :1;
        unsigned SSA14                  :1;
        unsigned SSA15                  :1;
    };
} DMAnSSAHbits_t;
extern volatile DMAnSSAHbits_t DMAnSSAHbits __at(0x0F9);
// bitfield macros
#define _DMAnSSAH_SSA_POSN                                  0x0
#define _DMAnSSAH_SSA_POSITION                              0x0
#define _DMAnSSAH_SSA_SIZE                                  0x8
#define _DMAnSSAH_SSA_LENGTH                                0x8
#define _DMAnSSAH_SSA_MASK                                  0xFF
#define _DMAnSSAH_SSA8_POSN                                 0x0
#define _DMAnSSAH_SSA8_POSITION                             0x0
#define _DMAnSSAH_SSA8_SIZE                                 0x1
#define _DMAnSSAH_SSA8_LENGTH                               0x1
#define _DMAnSSAH_SSA8_MASK                                 0x1
#define _DMAnSSAH_SSA9_POSN                                 0x1
#define _DMAnSSAH_SSA9_POSITION                             0x1
#define _DMAnSSAH_SSA9_SIZE                                 0x1
#define _DMAnSSAH_SSA9_LENGTH                               0x1
#define _DMAnSSAH_SSA9_MASK                                 0x2
#define _DMAnSSAH_SSA10_POSN                                0x2
#define _DMAnSSAH_SSA10_POSITION                            0x2
#define _DMAnSSAH_SSA10_SIZE                                0x1
#define _DMAnSSAH_SSA10_LENGTH                              0x1
#define _DMAnSSAH_SSA10_MASK                                0x4
#define _DMAnSSAH_SSA11_POSN                                0x3
#define _DMAnSSAH_SSA11_POSITION                            0x3
#define _DMAnSSAH_SSA11_SIZE                                0x1
#define _DMAnSSAH_SSA11_LENGTH                              0x1
#define _DMAnSSAH_SSA11_MASK                                0x8
#define _DMAnSSAH_SSA12_POSN                                0x4
#define _DMAnSSAH_SSA12_POSITION                            0x4
#define _DMAnSSAH_SSA12_SIZE                                0x1
#define _DMAnSSAH_SSA12_LENGTH                              0x1
#define _DMAnSSAH_SSA12_MASK                                0x10
#define _DMAnSSAH_SSA13_POSN                                0x5
#define _DMAnSSAH_SSA13_POSITION                            0x5
#define _DMAnSSAH_SSA13_SIZE                                0x1
#define _DMAnSSAH_SSA13_LENGTH                              0x1
#define _DMAnSSAH_SSA13_MASK                                0x20
#define _DMAnSSAH_SSA14_POSN                                0x6
#define _DMAnSSAH_SSA14_POSITION                            0x6
#define _DMAnSSAH_SSA14_SIZE                                0x1
#define _DMAnSSAH_SSA14_LENGTH                              0x1
#define _DMAnSSAH_SSA14_MASK                                0x40
#define _DMAnSSAH_SSA15_POSN                                0x7
#define _DMAnSSAH_SSA15_POSITION                            0x7
#define _DMAnSSAH_SSA15_SIZE                                0x1
#define _DMAnSSAH_SSA15_LENGTH                              0x1
#define _DMAnSSAH_SSA15_MASK                                0x80

// Register: DMAnSSAU
#define DMAnSSAU DMAnSSAU
extern volatile unsigned char           DMAnSSAU            __at(0x0FA);
#ifndef _LIB_BUILD
asm("DMAnSSAU equ 0FAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA16                  :1;
        unsigned SSA17                  :1;
        unsigned SSA18                  :1;
        unsigned SSA19                  :1;
        unsigned SSA20                  :1;
        unsigned SSA21                  :1;
    };
} DMAnSSAUbits_t;
