garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
// Register: I2C2ADB1
#define I2C2ADB1 I2C2ADB1
extern volatile unsigned char           I2C2ADB1            __at(0x2A4);
#ifndef _LIB_BUILD
asm("I2C2ADB1 equ 02A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C2ADB1bits_t;
extern volatile I2C2ADB1bits_t I2C2ADB1bits __at(0x2A4);
// bitfield macros
#define _I2C2ADB1_ADB_POSN                                  0x0
#define _I2C2ADB1_ADB_POSITION                              0x0
#define _I2C2ADB1_ADB_SIZE                                  0x8
#define _I2C2ADB1_ADB_LENGTH                                0x8
#define _I2C2ADB1_ADB_MASK                                  0xFF

// Register: I2C2ADR0
#define I2C2ADR0 I2C2ADR0
extern volatile unsigned char           I2C2ADR0            __at(0x2A5);
#ifndef _LIB_BUILD
asm("I2C2ADR0 equ 02A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C2ADR0bits_t;
extern volatile I2C2ADR0bits_t I2C2ADR0bits __at(0x2A5);
// bitfield macros
#define _I2C2ADR0_ADR_POSN                                  0x0
#define _I2C2ADR0_ADR_POSITION                              0x0
#define _I2C2ADR0_ADR_SIZE                                  0x8
#define _I2C2ADR0_ADR_LENGTH                                0x8
#define _I2C2ADR0_ADR_MASK                                  0xFF

// Register: I2C2ADR1
#define I2C2ADR1 I2C2ADR1
extern volatile unsigned char           I2C2ADR1            __at(0x2A6);
#ifndef _LIB_BUILD
asm("I2C2ADR1 equ 02A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C2ADR1bits_t;
extern volatile I2C2ADR1bits_t I2C2ADR1bits __at(0x2A6);
// bitfield macros
#define _I2C2ADR1_ADR_POSN                                  0x1
#define _I2C2ADR1_ADR_POSITION                              0x1
#define _I2C2ADR1_ADR_SIZE                                  0x7
#define _I2C2ADR1_ADR_LENGTH                                0x7
#define _I2C2ADR1_ADR_MASK                                  0xFE

// Register: I2C2ADR2
#define I2C2ADR2 I2C2ADR2
extern volatile unsigned char           I2C2ADR2            __at(0x2A7);
#ifndef _LIB_BUILD
asm("I2C2ADR2 equ 02A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C2ADR2bits_t;
extern volatile I2C2ADR2bits_t I2C2ADR2bits __at(0x2A7);
// bitfield macros
#define _I2C2ADR2_ADR_POSN                                  0x0
#define _I2C2ADR2_ADR_POSITION                              0x0
#define _I2C2ADR2_ADR_SIZE                                  0x8
#define _I2C2ADR2_ADR_LENGTH                                0x8
#define _I2C2ADR2_ADR_MASK                                  0xFF

// Register: I2C2ADR3
#define I2C2ADR3 I2C2ADR3
extern volatile unsigned char           I2C2ADR3            __at(0x2A8);
#ifndef _LIB_BUILD
asm("I2C2ADR3 equ 02A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C2ADR3bits_t;
extern volatile I2C2ADR3bits_t I2C2ADR3bits __at(0x2A8);
// bitfield macros
#define _I2C2ADR3_ADR_POSN                                  0x1
#define _I2C2ADR3_ADR_POSITION                              0x1
#define _I2C2ADR3_ADR_SIZE                                  0x7
#define _I2C2ADR3_ADR_LENGTH                                0x7
#define _I2C2ADR3_ADR_MASK                                  0xFE

// Register: I2C2CON0
#define I2C2CON0 I2C2CON0
extern volatile unsigned char           I2C2CON0            __at(0x2A9);
#ifndef _LIB_BUILD
asm("I2C2CON0 equ 02A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned MDR                    :1;
        unsigned CSTR                   :1;
        unsigned S                      :1;
        unsigned RSEN                   :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned I2CEN                  :1;
    };
} I2C2CON0bits_t;
extern volatile I2C2CON0bits_t I2C2CON0bits __at(0x2A9);
// bitfield macros
#define _I2C2CON0_MODE_POSN                                 0x0
#define _I2C2CON0_MODE_POSITION                             0x0
#define _I2C2CON0_MODE_SIZE                                 0x3
#define _I2C2CON0_MODE_LENGTH                               0x3
#define _I2C2CON0_MODE_MASK                                 0x7
#define _I2C2CON0_MDR_POSN                                  0x3
#define _I2C2CON0_MDR_POSITION                              0x3
#define _I2C2CON0_MDR_SIZE                                  0x1
#define _I2C2CON0_MDR_LENGTH                                0x1
#define _I2C2CON0_MDR_MASK                                  0x8
#define _I2C2CON0_CSTR_POSN                                 0x4
#define _I2C2CON0_CSTR_POSITION                             0x4
#define _I2C2CON0_CSTR_SIZE                                 0x1
#define _I2C2CON0_CSTR_LENGTH                               0x1
#define _I2C2CON0_CSTR_MASK                                 0x10
#define _I2C2CON0_S_POSN                                    0x5
#define _I2C2CON0_S_POSITION                                0x5
#define _I2C2CON0_S_SIZE                                    0x1
#define _I2C2CON0_S_LENGTH                                  0x1
#define _I2C2CON0_S_MASK                                    0x20
#define _I2C2CON0_RSEN_POSN                                 0x6
#define _I2C2CON0_RSEN_POSITION                             0x6
#define _I2C2CON0_RSEN_SIZE                                 0x1
#define _I2C2CON0_RSEN_LENGTH                               0x1
#define _I2C2CON0_RSEN_MASK                                 0x40
#define _I2C2CON0_EN_POSN                                   0x7
#define _I2C2CON0_EN_POSITION                               0x7
#define _I2C2CON0_EN_SIZE                                   0x1
#define _I2C2CON0_EN_LENGTH                                 0x1
#define _I2C2CON0_EN_MASK                                   0x80
#define _I2C2CON0_MODE0_POSN                                0x0
#define _I2C2CON0_MODE0_POSITION                            0x0
#define _I2C2CON0_MODE0_SIZE                                0x1
#define _I2C2CON0_MODE0_LENGTH                              0x1
#define _I2C2CON0_MODE0_MASK                                0x1
#define _I2C2CON0_MODE1_POSN                                0x1
#define _I2C2CON0_MODE1_POSITION                            0x1
#define _I2C2CON0_MODE1_SIZE                                0x1
#define _I2C2CON0_MODE1_LENGTH                              0x1
#define _I2C2CON0_MODE1_MASK                                0x2
#define _I2C2CON0_MODE2_POSN                                0x2
#define _I2C2CON0_MODE2_POSITION                            0x2
#define _I2C2CON0_MODE2_SIZE                                0x1
#define _I2C2CON0_MODE2_LENGTH                              0x1
#define _I2C2CON0_MODE2_MASK                                0x4
#define _I2C2CON0_I2CEN_POSN                                0x7
#define _I2C2CON0_I2CEN_POSITION                            0x7
#define _I2C2CON0_I2CEN_SIZE                                0x1
#define _I2C2CON0_I2CEN_LENGTH                              0x1
#define _I2C2CON0_I2CEN_MASK                                0x80

// Register: I2C2CON1
#define I2C2CON1 I2C2CON1
extern volatile unsigned char           I2C2CON1            __at(0x2AA);
#ifndef _LIB_BUILD
asm("I2C2CON1 equ 02AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSD                    :1;
        unsigned TXU                    :1;
        unsigned RXO                    :1;
        unsigned P                      :1;
        unsigned ACKT                   :1;
        unsigned ACKSTAT                :1;
        unsigned ACKDT                  :1;
        unsigned ACKCNT                 :1;
    };
} I2C2CON1bits_t;
extern volatile I2C2CON1bits_t I2C2CON1bits __at(0x2AA);
// bitfield macros
#define _I2C2CON1_CSD_POSN                                  0x0
#define _I2C2CON1_CSD_POSITION                              0x0
#define _I2C2CON1_CSD_SIZE                                  0x1
#define _I2C2CON1_CSD_LENGTH                                0x1
#define _I2C2CON1_CSD_MASK                                  0x1
#define _I2C2CON1_TXU_POSN                                  0x1
#define _I2C2CON1_TXU_POSITION                              0x1
#define _I2C2CON1_TXU_SIZE                                  0x1
#define _I2C2CON1_TXU_LENGTH                                0x1
#define _I2C2CON1_TXU_MASK                                  0x2
#define _I2C2CON1_RXO_POSN                                  0x2
#define _I2C2CON1_RXO_POSITION                              0x2
#define _I2C2CON1_RXO_SIZE                                  0x1
#define _I2C2CON1_RXO_LENGTH                                0x1
#define _I2C2CON1_RXO_MASK                                  0x4
#define _I2C2CON1_P_POSN                                    0x3
#define _I2C2CON1_P_POSITION                                0x3
#define _I2C2CON1_P_SIZE                                    0x1
#define _I2C2CON1_P_LENGTH                                  0x1
#define _I2C2CON1_P_MASK                                    0x8
#define _I2C2CON1_ACKT_POSN                                 0x4
#define _I2C2CON1_ACKT_POSITION                             0x4
#define _I2C2CON1_ACKT_SIZE                                 0x1
#define _I2C2CON1_ACKT_LENGTH                               0x1
#define _I2C2CON1_ACKT_MASK                                 0x10
#define _I2C2CON1_ACKSTAT_POSN                              0x5
#define _I2C2CON1_ACKSTAT_POSITION                          0x5
#define _I2C2CON1_ACKSTAT_SIZE                              0x1
#define _I2C2CON1_ACKSTAT_LENGTH                            0x1
#define _I2C2CON1_ACKSTAT_MASK                              0x20
#define _I2C2CON1_ACKDT_POSN                                0x6
#define _I2C2CON1_ACKDT_POSITION                            0x6
#define _I2C2CON1_ACKDT_SIZE                                0x1
#define _I2C2CON1_ACKDT_LENGTH                              0x1
#define _I2C2CON1_ACKDT_MASK                                0x40
#define _I2C2CON1_ACKCNT_POSN                               0x7
#define _I2C2CON1_ACKCNT_POSITION                           0x7
#define _I2C2CON1_ACKCNT_SIZE                               0x1
#define _I2C2CON1_ACKCNT_LENGTH                             0x1
#define _I2C2CON1_ACKCNT_MASK                               0x80

