garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
// Register: I2C2CON2
#define I2C2CON2 I2C2CON2
extern volatile unsigned char           I2C2CON2            __at(0x2AB);
#ifndef _LIB_BUILD
asm("I2C2CON2 equ 02ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BFRET                  :2;
        unsigned SDAHT                  :2;
        unsigned ABD                    :1;
        unsigned                        :1;
        unsigned GCEN                   :1;
        unsigned ACNT                   :1;
    };
    struct {
        unsigned BFRET0                 :1;
        unsigned BFRET1                 :1;
        unsigned SDAHT0                 :1;
        unsigned SDAHT1                 :1;
    };
} I2C2CON2bits_t;
extern volatile I2C2CON2bits_t I2C2CON2bits __at(0x2AB);
// bitfield macros
#define _I2C2CON2_BFRET_POSN                                0x0
#define _I2C2CON2_BFRET_POSITION                            0x0
#define _I2C2CON2_BFRET_SIZE                                0x2
#define _I2C2CON2_BFRET_LENGTH                              0x2
#define _I2C2CON2_BFRET_MASK                                0x3
#define _I2C2CON2_SDAHT_POSN                                0x2
#define _I2C2CON2_SDAHT_POSITION                            0x2
#define _I2C2CON2_SDAHT_SIZE                                0x2
#define _I2C2CON2_SDAHT_LENGTH                              0x2
#define _I2C2CON2_SDAHT_MASK                                0xC
#define _I2C2CON2_ABD_POSN                                  0x4
#define _I2C2CON2_ABD_POSITION                              0x4
#define _I2C2CON2_ABD_SIZE                                  0x1
#define _I2C2CON2_ABD_LENGTH                                0x1
#define _I2C2CON2_ABD_MASK                                  0x10
#define _I2C2CON2_GCEN_POSN                                 0x6
#define _I2C2CON2_GCEN_POSITION                             0x6
#define _I2C2CON2_GCEN_SIZE                                 0x1
#define _I2C2CON2_GCEN_LENGTH                               0x1
#define _I2C2CON2_GCEN_MASK                                 0x40
#define _I2C2CON2_ACNT_POSN                                 0x7
#define _I2C2CON2_ACNT_POSITION                             0x7
#define _I2C2CON2_ACNT_SIZE                                 0x1
#define _I2C2CON2_ACNT_LENGTH                               0x1
#define _I2C2CON2_ACNT_MASK                                 0x80
#define _I2C2CON2_BFRET0_POSN                               0x0
#define _I2C2CON2_BFRET0_POSITION                           0x0
#define _I2C2CON2_BFRET0_SIZE                               0x1
#define _I2C2CON2_BFRET0_LENGTH                             0x1
#define _I2C2CON2_BFRET0_MASK                               0x1
#define _I2C2CON2_BFRET1_POSN                               0x1
#define _I2C2CON2_BFRET1_POSITION                           0x1
#define _I2C2CON2_BFRET1_SIZE                               0x1
#define _I2C2CON2_BFRET1_LENGTH                             0x1
#define _I2C2CON2_BFRET1_MASK                               0x2
#define _I2C2CON2_SDAHT0_POSN                               0x2
#define _I2C2CON2_SDAHT0_POSITION                           0x2
#define _I2C2CON2_SDAHT0_SIZE                               0x1
#define _I2C2CON2_SDAHT0_LENGTH                             0x1
#define _I2C2CON2_SDAHT0_MASK                               0x4
#define _I2C2CON2_SDAHT1_POSN                               0x3
#define _I2C2CON2_SDAHT1_POSITION                           0x3
#define _I2C2CON2_SDAHT1_SIZE                               0x1
#define _I2C2CON2_SDAHT1_LENGTH                             0x1
#define _I2C2CON2_SDAHT1_MASK                               0x8

// Register: I2C2CON3
#define I2C2CON3 I2C2CON3
extern volatile unsigned char           I2C2CON3            __at(0x2AC);
#ifndef _LIB_BUILD
asm("I2C2CON3 equ 02ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACNTMD                 :2;
        unsigned FME                    :2;
    };
    struct {
        unsigned ACNTMD0                :1;
        unsigned ACNTMD1                :1;
        unsigned FME0                   :1;
        unsigned FME1                   :1;
    };
} I2C2CON3bits_t;
extern volatile I2C2CON3bits_t I2C2CON3bits __at(0x2AC);
// bitfield macros
#define _I2C2CON3_ACNTMD_POSN                               0x0
#define _I2C2CON3_ACNTMD_POSITION                           0x0
#define _I2C2CON3_ACNTMD_SIZE                               0x2
#define _I2C2CON3_ACNTMD_LENGTH                             0x2
#define _I2C2CON3_ACNTMD_MASK                               0x3
#define _I2C2CON3_FME_POSN                                  0x2
#define _I2C2CON3_FME_POSITION                              0x2
#define _I2C2CON3_FME_SIZE                                  0x2
#define _I2C2CON3_FME_LENGTH                                0x2
#define _I2C2CON3_FME_MASK                                  0xC
#define _I2C2CON3_ACNTMD0_POSN                              0x0
#define _I2C2CON3_ACNTMD0_POSITION                          0x0
#define _I2C2CON3_ACNTMD0_SIZE                              0x1
#define _I2C2CON3_ACNTMD0_LENGTH                            0x1
#define _I2C2CON3_ACNTMD0_MASK                              0x1
#define _I2C2CON3_ACNTMD1_POSN                              0x1
#define _I2C2CON3_ACNTMD1_POSITION                          0x1
#define _I2C2CON3_ACNTMD1_SIZE                              0x1
#define _I2C2CON3_ACNTMD1_LENGTH                            0x1
#define _I2C2CON3_ACNTMD1_MASK                              0x2
#define _I2C2CON3_FME0_POSN                                 0x2
#define _I2C2CON3_FME0_POSITION                             0x2
#define _I2C2CON3_FME0_SIZE                                 0x1
#define _I2C2CON3_FME0_LENGTH                               0x1
#define _I2C2CON3_FME0_MASK                                 0x4
#define _I2C2CON3_FME1_POSN                                 0x3
#define _I2C2CON3_FME1_POSITION                             0x3
#define _I2C2CON3_FME1_SIZE                                 0x1
#define _I2C2CON3_FME1_LENGTH                               0x1
#define _I2C2CON3_FME1_MASK                                 0x8

