garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
extern volatile U2BRGHbits_t U2BRGHbits __at(0x2D7);
// bitfield macros
#define _U2BRGH_BRGH_POSN                                   0x0
#define _U2BRGH_BRGH_POSITION                               0x0
#define _U2BRGH_BRGH_SIZE                                   0x8
#define _U2BRGH_BRGH_LENGTH                                 0x8
#define _U2BRGH_BRGH_MASK                                   0xFF

// Register: U2FIFO
#define U2FIFO U2FIFO
extern volatile unsigned char           U2FIFO              __at(0x2D8);
#ifndef _LIB_BUILD
asm("U2FIFO equ 02D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U2RXBF                 :1;
        unsigned U2RXBE                 :1;
        unsigned U2XON                  :1;
        unsigned U2RXIDL                :1;
        unsigned U2TXBF                 :1;
        unsigned U2TXBE                 :1;
        unsigned U2STPMD                :1;
        unsigned U2TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U2RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U2FIFObits_t;
extern volatile U2FIFObits_t U2FIFObits __at(0x2D8);
// bitfield macros
#define _U2FIFO_RXBF_POSN                                   0x0
#define _U2FIFO_RXBF_POSITION                               0x0
#define _U2FIFO_RXBF_SIZE                                   0x1
#define _U2FIFO_RXBF_LENGTH                                 0x1
#define _U2FIFO_RXBF_MASK                                   0x1
#define _U2FIFO_RXBE_POSN                                   0x1
#define _U2FIFO_RXBE_POSITION                               0x1
#define _U2FIFO_RXBE_SIZE                                   0x1
#define _U2FIFO_RXBE_LENGTH                                 0x1
#define _U2FIFO_RXBE_MASK                                   0x2
#define _U2FIFO_XON_POSN                                    0x2
#define _U2FIFO_XON_POSITION                                0x2
#define _U2FIFO_XON_SIZE                                    0x1
#define _U2FIFO_XON_LENGTH                                  0x1
#define _U2FIFO_XON_MASK                                    0x4
#define _U2FIFO_RXIDL_POSN                                  0x3
#define _U2FIFO_RXIDL_POSITION                              0x3
#define _U2FIFO_RXIDL_SIZE                                  0x1
#define _U2FIFO_RXIDL_LENGTH                                0x1
#define _U2FIFO_RXIDL_MASK                                  0x8
#define _U2FIFO_TXBF_POSN                                   0x4
#define _U2FIFO_TXBF_POSITION                               0x4
#define _U2FIFO_TXBF_SIZE                                   0x1
#define _U2FIFO_TXBF_LENGTH                                 0x1
#define _U2FIFO_TXBF_MASK                                   0x10
#define _U2FIFO_TXBE_POSN                                   0x5
#define _U2FIFO_TXBE_POSITION                               0x5
#define _U2FIFO_TXBE_SIZE                                   0x1
#define _U2FIFO_TXBE_LENGTH                                 0x1
#define _U2FIFO_TXBE_MASK                                   0x20
#define _U2FIFO_STPMD_POSN                                  0x6
#define _U2FIFO_STPMD_POSITION                              0x6
#define _U2FIFO_STPMD_SIZE                                  0x1
#define _U2FIFO_STPMD_LENGTH                                0x1
#define _U2FIFO_STPMD_MASK                                  0x40
#define _U2FIFO_TXWRE_POSN                                  0x7
#define _U2FIFO_TXWRE_POSITION                              0x7
#define _U2FIFO_TXWRE_SIZE                                  0x1
#define _U2FIFO_TXWRE_LENGTH                                0x1
#define _U2FIFO_TXWRE_MASK                                  0x80
#define _U2FIFO_U2RXBF_POSN                                 0x0
#define _U2FIFO_U2RXBF_POSITION                             0x0
#define _U2FIFO_U2RXBF_SIZE                                 0x1
#define _U2FIFO_U2RXBF_LENGTH                               0x1
#define _U2FIFO_U2RXBF_MASK                                 0x1
#define _U2FIFO_U2RXBE_POSN                                 0x1
#define _U2FIFO_U2RXBE_POSITION                             0x1
#define _U2FIFO_U2RXBE_SIZE                                 0x1
#define _U2FIFO_U2RXBE_LENGTH                               0x1
#define _U2FIFO_U2RXBE_MASK                                 0x2
#define _U2FIFO_U2XON_POSN                                  0x2
#define _U2FIFO_U2XON_POSITION                              0x2
#define _U2FIFO_U2XON_SIZE                                  0x1
#define _U2FIFO_U2XON_LENGTH                                0x1
#define _U2FIFO_U2XON_MASK                                  0x4
#define _U2FIFO_U2RXIDL_POSN                                0x3
#define _U2FIFO_U2RXIDL_POSITION                            0x3
#define _U2FIFO_U2RXIDL_SIZE                                0x1
#define _U2FIFO_U2RXIDL_LENGTH                              0x1
#define _U2FIFO_U2RXIDL_MASK                                0x8
#define _U2FIFO_U2TXBF_POSN                                 0x4
#define _U2FIFO_U2TXBF_POSITION                             0x4
#define _U2FIFO_U2TXBF_SIZE                                 0x1
#define _U2FIFO_U2TXBF_LENGTH                               0x1
#define _U2FIFO_U2TXBF_MASK                                 0x10
#define _U2FIFO_U2TXBE_POSN                                 0x5
#define _U2FIFO_U2TXBE_POSITION                             0x5
#define _U2FIFO_U2TXBE_SIZE                                 0x1
#define _U2FIFO_U2TXBE_LENGTH                               0x1
#define _U2FIFO_U2TXBE_MASK                                 0x20
#define _U2FIFO_U2STPMD_POSN                                0x6
#define _U2FIFO_U2STPMD_POSITION                            0x6
#define _U2FIFO_U2STPMD_SIZE                                0x1
#define _U2FIFO_U2STPMD_LENGTH                              0x1
#define _U2FIFO_U2STPMD_MASK                                0x40
#define _U2FIFO_U2TXWRE_POSN                                0x7
#define _U2FIFO_U2TXWRE_POSITION                            0x7
#define _U2FIFO_U2TXWRE_SIZE                                0x1
#define _U2FIFO_U2TXWRE_LENGTH                              0x1
#define _U2FIFO_U2TXWRE_MASK                                0x80
#define _U2FIFO_U2RCIDL_POSN                                0x3
#define _U2FIFO_U2RCIDL_POSITION                            0x3
#define _U2FIFO_U2RCIDL_SIZE                                0x1
#define _U2FIFO_U2RCIDL_LENGTH                              0x1
#define _U2FIFO_U2RCIDL_MASK                                0x8
#define _U2FIFO_RCIDL_POSN                                  0x3
#define _U2FIFO_RCIDL_POSITION                              0x3
#define _U2FIFO_RCIDL_SIZE                                  0x1
#define _U2FIFO_RCIDL_LENGTH                                0x1
#define _U2FIFO_RCIDL_MASK                                  0x8

// Register: U2UIR
#define U2UIR U2UIR
extern volatile unsigned char           U2UIR               __at(0x2D9);
#ifndef _LIB_BUILD
asm("U2UIR equ 02D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U2ABDIE                :1;
        unsigned                        :3;
        unsigned U2ABDIF                :1;
        unsigned U2WUIF                 :1;
    };
} U2UIRbits_t;
extern volatile U2UIRbits_t U2UIRbits __at(0x2D9);
// bitfield macros
#define _U2UIR_ABDIE_POSN                                   0x2
#define _U2UIR_ABDIE_POSITION                               0x2
#define _U2UIR_ABDIE_SIZE                                   0x1
#define _U2UIR_ABDIE_LENGTH                                 0x1
#define _U2UIR_ABDIE_MASK                                   0x4
#define _U2UIR_ABDIF_POSN                                   0x6
#define _U2UIR_ABDIF_POSITION                               0x6
#define _U2UIR_ABDIF_SIZE                                   0x1
#define _U2UIR_ABDIF_LENGTH                                 0x1
#define _U2UIR_ABDIF_MASK                                   0x40
#define _U2UIR_WUIF_POSN                                    0x7
#define _U2UIR_WUIF_POSITION                                0x7
#define _U2UIR_WUIF_SIZE                                    0x1
#define _U2UIR_WUIF_LENGTH                                  0x1
#define _U2UIR_WUIF_MASK                                    0x80
#define _U2UIR_U2ABDIE_POSN                                 0x2
#define _U2UIR_U2ABDIE_POSITION                             0x2
#define _U2UIR_U2ABDIE_SIZE                                 0x1
#define _U2UIR_U2ABDIE_LENGTH                               0x1
#define _U2UIR_U2ABDIE_MASK                                 0x4
#define _U2UIR_U2ABDIF_POSN                                 0x6
#define _U2UIR_U2ABDIF_POSITION                             0x6
#define _U2UIR_U2ABDIF_SIZE                                 0x1
#define _U2UIR_U2ABDIF_LENGTH                               0x1
#define _U2UIR_U2ABDIF_MASK                                 0x40
#define _U2UIR_U2WUIF_POSN                                  0x7
#define _U2UIR_U2WUIF_POSITION                              0x7
#define _U2UIR_U2WUIF_SIZE                                  0x1
#define _U2UIR_U2WUIF_LENGTH                                0x1
#define _U2UIR_U2WUIF_MASK                                  0x80

// Register: U2ERRIR
#define U2ERRIR U2ERRIR
extern volatile unsigned char           U2ERRIR             __at(0x2DA);
#ifndef _LIB_BUILD
asm("U2ERRIR equ 02DAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U2TXCIF                :1;
        unsigned U2RXFOIF               :1;
        unsigned U2RXBKIF               :1;
        unsigned U2FERIF                :1;
        unsigned U2CERIF                :1;
        unsigned U2ABDOVF               :1;
        unsigned U2PERIF                :1;
        unsigned U2TXMTIF               :1;
    };
} U2ERRIRbits_t;
