garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
extern volatile TU16ACRLbits_t TU16ACRLbits __at(0x3A1);
// bitfield macros
#define _TU16ACRL_CRL_POSN                                  0x0
#define _TU16ACRL_CRL_POSITION                              0x0
#define _TU16ACRL_CRL_SIZE                                  0x8
#define _TU16ACRL_CRL_LENGTH                                0x8
#define _TU16ACRL_CRL_MASK                                  0xFF
#define _TU16ACRL_CRL0_POSN                                 0x0
#define _TU16ACRL_CRL0_POSITION                             0x0
#define _TU16ACRL_CRL0_SIZE                                 0x1
#define _TU16ACRL_CRL0_LENGTH                               0x1
#define _TU16ACRL_CRL0_MASK                                 0x1
#define _TU16ACRL_CRL1_POSN                                 0x1
#define _TU16ACRL_CRL1_POSITION                             0x1
#define _TU16ACRL_CRL1_SIZE                                 0x1
#define _TU16ACRL_CRL1_LENGTH                               0x1
#define _TU16ACRL_CRL1_MASK                                 0x2
#define _TU16ACRL_CRL2_POSN                                 0x2
#define _TU16ACRL_CRL2_POSITION                             0x2
#define _TU16ACRL_CRL2_SIZE                                 0x1
#define _TU16ACRL_CRL2_LENGTH                               0x1
#define _TU16ACRL_CRL2_MASK                                 0x4
#define _TU16ACRL_CRL3_POSN                                 0x3
#define _TU16ACRL_CRL3_POSITION                             0x3
#define _TU16ACRL_CRL3_SIZE                                 0x1
#define _TU16ACRL_CRL3_LENGTH                               0x1
#define _TU16ACRL_CRL3_MASK                                 0x8
#define _TU16ACRL_CRL4_POSN                                 0x4
#define _TU16ACRL_CRL4_POSITION                             0x4
#define _TU16ACRL_CRL4_SIZE                                 0x1
#define _TU16ACRL_CRL4_LENGTH                               0x1
#define _TU16ACRL_CRL4_MASK                                 0x10
#define _TU16ACRL_CRL5_POSN                                 0x5
#define _TU16ACRL_CRL5_POSITION                             0x5
#define _TU16ACRL_CRL5_SIZE                                 0x1
#define _TU16ACRL_CRL5_LENGTH                               0x1
#define _TU16ACRL_CRL5_MASK                                 0x20
#define _TU16ACRL_CRL6_POSN                                 0x6
#define _TU16ACRL_CRL6_POSITION                             0x6
#define _TU16ACRL_CRL6_SIZE                                 0x1
#define _TU16ACRL_CRL6_LENGTH                               0x1
#define _TU16ACRL_CRL6_MASK                                 0x40
#define _TU16ACRL_CRL7_POSN                                 0x7
#define _TU16ACRL_CRL7_POSITION                             0x7
#define _TU16ACRL_CRL7_SIZE                                 0x1
#define _TU16ACRL_CRL7_LENGTH                               0x1
#define _TU16ACRL_CRL7_MASK                                 0x80
#define _TU16ACRL_TU16ACRL0_POSN                            0x0
#define _TU16ACRL_TU16ACRL0_POSITION                        0x0
#define _TU16ACRL_TU16ACRL0_SIZE                            0x1
#define _TU16ACRL_TU16ACRL0_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL0_MASK                            0x1
#define _TU16ACRL_TU16ACRL1_POSN                            0x1
#define _TU16ACRL_TU16ACRL1_POSITION                        0x1
#define _TU16ACRL_TU16ACRL1_SIZE                            0x1
#define _TU16ACRL_TU16ACRL1_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL1_MASK                            0x2
#define _TU16ACRL_TU16ACRL2_POSN                            0x2
#define _TU16ACRL_TU16ACRL2_POSITION                        0x2
#define _TU16ACRL_TU16ACRL2_SIZE                            0x1
#define _TU16ACRL_TU16ACRL2_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL2_MASK                            0x4
#define _TU16ACRL_TU16ACRL3_POSN                            0x3
#define _TU16ACRL_TU16ACRL3_POSITION                        0x3
#define _TU16ACRL_TU16ACRL3_SIZE                            0x1
#define _TU16ACRL_TU16ACRL3_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL3_MASK                            0x8
#define _TU16ACRL_TU16ACRL4_POSN                            0x4
#define _TU16ACRL_TU16ACRL4_POSITION                        0x4
#define _TU16ACRL_TU16ACRL4_SIZE                            0x1
#define _TU16ACRL_TU16ACRL4_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL4_MASK                            0x10
#define _TU16ACRL_TU16ACRL5_POSN                            0x5
#define _TU16ACRL_TU16ACRL5_POSITION                        0x5
#define _TU16ACRL_TU16ACRL5_SIZE                            0x1
#define _TU16ACRL_TU16ACRL5_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL5_MASK                            0x20
#define _TU16ACRL_TU16ACRL6_POSN                            0x6
#define _TU16ACRL_TU16ACRL6_POSITION                        0x6
#define _TU16ACRL_TU16ACRL6_SIZE                            0x1
#define _TU16ACRL_TU16ACRL6_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL6_MASK                            0x40
#define _TU16ACRL_TU16ACRL7_POSN                            0x7
#define _TU16ACRL_TU16ACRL7_POSITION                        0x7
#define _TU16ACRL_TU16ACRL7_SIZE                            0x1
#define _TU16ACRL_TU16ACRL7_LENGTH                          0x1
#define _TU16ACRL_TU16ACRL7_MASK                            0x80
#define _TU16ACRL_TU16ACR0_POSN                             0x0
#define _TU16ACRL_TU16ACR0_POSITION                         0x0
#define _TU16ACRL_TU16ACR0_SIZE                             0x1
#define _TU16ACRL_TU16ACR0_LENGTH                           0x1
#define _TU16ACRL_TU16ACR0_MASK                             0x1
#define _TU16ACRL_TU16ACR1_POSN                             0x1
#define _TU16ACRL_TU16ACR1_POSITION                         0x1
#define _TU16ACRL_TU16ACR1_SIZE                             0x1
#define _TU16ACRL_TU16ACR1_LENGTH                           0x1
#define _TU16ACRL_TU16ACR1_MASK                             0x2
#define _TU16ACRL_TU16ACR2_POSN                             0x2
#define _TU16ACRL_TU16ACR2_POSITION                         0x2
#define _TU16ACRL_TU16ACR2_SIZE                             0x1
#define _TU16ACRL_TU16ACR2_LENGTH                           0x1
#define _TU16ACRL_TU16ACR2_MASK                             0x4
#define _TU16ACRL_TU16ACR3_POSN                             0x3
#define _TU16ACRL_TU16ACR3_POSITION                         0x3
#define _TU16ACRL_TU16ACR3_SIZE                             0x1
#define _TU16ACRL_TU16ACR3_LENGTH                           0x1
#define _TU16ACRL_TU16ACR3_MASK                             0x8
#define _TU16ACRL_TU16ACR4_POSN                             0x4
#define _TU16ACRL_TU16ACR4_POSITION                         0x4
#define _TU16ACRL_TU16ACR4_SIZE                             0x1
#define _TU16ACRL_TU16ACR4_LENGTH                           0x1
#define _TU16ACRL_TU16ACR4_MASK                             0x10
#define _TU16ACRL_TU16ACR5_POSN                             0x5
#define _TU16ACRL_TU16ACR5_POSITION                         0x5
#define _TU16ACRL_TU16ACR5_SIZE                             0x1
#define _TU16ACRL_TU16ACR5_LENGTH                           0x1
#define _TU16ACRL_TU16ACR5_MASK                             0x20
#define _TU16ACRL_TU16ACR6_POSN                             0x6
#define _TU16ACRL_TU16ACR6_POSITION                         0x6
#define _TU16ACRL_TU16ACR6_SIZE                             0x1
#define _TU16ACRL_TU16ACR6_LENGTH                           0x1
#define _TU16ACRL_TU16ACR6_MASK                             0x40
#define _TU16ACRL_TU16ACR7_POSN                             0x7
#define _TU16ACRL_TU16ACR7_POSITION                         0x7
#define _TU16ACRL_TU16ACR7_SIZE                             0x1
#define _TU16ACRL_TU16ACR7_LENGTH                           0x1
#define _TU16ACRL_TU16ACR7_MASK                             0x80

// Register: TU16ATMRH
#define TU16ATMRH TU16ATMRH
extern volatile unsigned char           TU16ATMRH           __at(0x3A2);
#ifndef _LIB_BUILD
asm("TU16ATMRH equ 03A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMRH                   :8;
    };
    struct {
        unsigned TMRH0                  :1;
        unsigned TMRH1                  :1;
        unsigned TMRH2                  :1;
        unsigned TMRH3                  :1;
        unsigned TMRH4                  :1;
        unsigned TMRH5                  :1;
        unsigned TMRH6                  :1;
        unsigned TMRH7                  :1;
    };
    struct {
        unsigned TU16ATMRH0             :1;
        unsigned TU16ATMRH1             :1;
        unsigned TU16ATMRH2             :1;
        unsigned TU16ATMRH3             :1;
        unsigned TU16ATMRH4             :1;
        unsigned TU16ATMRH5             :1;
        unsigned TU16ATMRH6             :1;
        unsigned TU16ATMRH7             :1;
    };
    struct {
        unsigned TU16ATMR8              :1;
        unsigned TU16ATMR9              :1;
        unsigned TU16ATMR10             :1;
        unsigned TU16ATMR11             :1;
        unsigned TU16ATMR12             :1;
        unsigned TU16ATMR13             :1;
        unsigned TU16ATMR14             :1;
        unsigned TU16ATMR15             :1;
    };
} TU16ATMRHbits_t;
extern volatile TU16ATMRHbits_t TU16ATMRHbits __at(0x3A2);
// bitfield macros
#define _TU16ATMRH_TMRH_POSN                                0x0
#define _TU16ATMRH_TMRH_POSITION                            0x0
#define _TU16ATMRH_TMRH_SIZE                                0x8
#define _TU16ATMRH_TMRH_LENGTH                              0x8
#define _TU16ATMRH_TMRH_MASK                                0xFF
#define _TU16ATMRH_TMRH0_POSN                               0x0
#define _TU16ATMRH_TMRH0_POSITION                           0x0
#define _TU16ATMRH_TMRH0_SIZE                               0x1
#define _TU16ATMRH_TMRH0_LENGTH                             0x1
#define _TU16ATMRH_TMRH0_MASK                               0x1
#define _TU16ATMRH_TMRH1_POSN                               0x1
#define _TU16ATMRH_TMRH1_POSITION                           0x1
#define _TU16ATMRH_TMRH1_SIZE                               0x1
#define _TU16ATMRH_TMRH1_LENGTH                             0x1
#define _TU16ATMRH_TMRH1_MASK                               0x2
#define _TU16ATMRH_TMRH2_POSN                               0x2
#define _TU16ATMRH_TMRH2_POSITION                           0x2
#define _TU16ATMRH_TMRH2_SIZE                               0x1
#define _TU16ATMRH_TMRH2_LENGTH                             0x1
#define _TU16ATMRH_TMRH2_MASK                               0x4
#define _TU16ATMRH_TMRH3_POSN                               0x3
#define _TU16ATMRH_TMRH3_POSITION                           0x3
#define _TU16ATMRH_TMRH3_SIZE                               0x1
#define _TU16ATMRH_TMRH3_LENGTH                             0x1
#define _TU16ATMRH_TMRH3_MASK                               0x8
#define _TU16ATMRH_TMRH4_POSN                               0x4
#define _TU16ATMRH_TMRH4_POSITION                           0x4
#define _TU16ATMRH_TMRH4_SIZE                               0x1
#define _TU16ATMRH_TMRH4_LENGTH                             0x1
#define _TU16ATMRH_TMRH4_MASK                               0x10
#define _TU16ATMRH_TMRH5_POSN                               0x5
#define _TU16ATMRH_TMRH5_POSITION                           0x5
#define _TU16ATMRH_TMRH5_SIZE                               0x1
#define _TU16ATMRH_TMRH5_LENGTH                             0x1
#define _TU16ATMRH_TMRH5_MASK                               0x20
#define _TU16ATMRH_TMRH6_POSN                               0x6
#define _TU16ATMRH_TMRH6_POSITION                           0x6
#define _TU16ATMRH_TMRH6_SIZE                               0x1
#define _TU16ATMRH_TMRH6_LENGTH                             0x1
#define _TU16ATMRH_TMRH6_MASK                               0x40
#define _TU16ATMRH_TMRH7_POSN                               0x7
#define _TU16ATMRH_TMRH7_POSITION                           0x7
#define _TU16ATMRH_TMRH7_SIZE                               0x1
#define _TU16ATMRH_TMRH7_LENGTH                             0x1
#define _TU16ATMRH_TMRH7_MASK                               0x80
#define _TU16ATMRH_TU16ATMRH0_POSN                          0x0
#define _TU16ATMRH_TU16ATMRH0_POSITION                      0x0
#define _TU16ATMRH_TU16ATMRH0_SIZE                          0x1
#define _TU16ATMRH_TU16ATMRH0_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMRH0_MASK                          0x1
#define _TU16ATMRH_TU16ATMRH1_POSN                          0x1
#define _TU16ATMRH_TU16ATMRH1_POSITION                      0x1
#define _TU16ATMRH_TU16ATMRH1_SIZE                          0x1
#define _TU16ATMRH_TU16ATMRH1_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMRH1_MASK                          0x2
#define _TU16ATMRH_TU16ATMRH2_POSN                          0x2
#define _TU16ATMRH_TU16ATMRH2_POSITION                      0x2
#define _TU16ATMRH_TU16ATMRH2_SIZE                          0x1
#define _TU16ATMRH_TU16ATMRH2_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMRH2_MASK                          0x4
#define _TU16ATMRH_TU16ATMRH3_POSN                          0x3
#define _TU16ATMRH_TU16ATMRH3_POSITION                      0x3
#define _TU16ATMRH_TU16ATMRH3_SIZE                          0x1
#define _TU16ATMRH_TU16ATMRH3_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMRH3_MASK                          0x8
#define _TU16ATMRH_TU16ATMRH4_POSN                          0x4
#define _TU16ATMRH_TU16ATMRH4_POSITION                      0x4
#define _TU16ATMRH_TU16ATMRH4_SIZE                          0x1
#define _TU16ATMRH_TU16ATMRH4_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMRH4_MASK                          0x10
#define _TU16ATMRH_TU16ATMRH5_POSN                          0x5
#define _TU16ATMRH_TU16ATMRH5_POSITION                      0x5
#define _TU16ATMRH_TU16ATMRH5_SIZE                          0x1
#define _TU16ATMRH_TU16ATMRH5_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMRH5_MASK                          0x20
#define _TU16ATMRH_TU16ATMRH6_POSN                          0x6
#define _TU16ATMRH_TU16ATMRH6_POSITION                      0x6
#define _TU16ATMRH_TU16ATMRH6_SIZE                          0x1
#define _TU16ATMRH_TU16ATMRH6_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMRH6_MASK                          0x40
#define _TU16ATMRH_TU16ATMRH7_POSN                          0x7
#define _TU16ATMRH_TU16ATMRH7_POSITION                      0x7
#define _TU16ATMRH_TU16ATMRH7_SIZE                          0x1
#define _TU16ATMRH_TU16ATMRH7_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMRH7_MASK                          0x80
#define _TU16ATMRH_TU16ATMR8_POSN                           0x0
#define _TU16ATMRH_TU16ATMR8_POSITION                       0x0
#define _TU16ATMRH_TU16ATMR8_SIZE                           0x1
#define _TU16ATMRH_TU16ATMR8_LENGTH                         0x1
#define _TU16ATMRH_TU16ATMR8_MASK                           0x1
#define _TU16ATMRH_TU16ATMR9_POSN                           0x1
#define _TU16ATMRH_TU16ATMR9_POSITION                       0x1
#define _TU16ATMRH_TU16ATMR9_SIZE                           0x1
#define _TU16ATMRH_TU16ATMR9_LENGTH                         0x1
#define _TU16ATMRH_TU16ATMR9_MASK                           0x2
#define _TU16ATMRH_TU16ATMR10_POSN                          0x2
#define _TU16ATMRH_TU16ATMR10_POSITION                      0x2
#define _TU16ATMRH_TU16ATMR10_SIZE                          0x1
#define _TU16ATMRH_TU16ATMR10_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMR10_MASK                          0x4
#define _TU16ATMRH_TU16ATMR11_POSN                          0x3
#define _TU16ATMRH_TU16ATMR11_POSITION                      0x3
#define _TU16ATMRH_TU16ATMR11_SIZE                          0x1
#define _TU16ATMRH_TU16ATMR11_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMR11_MASK                          0x8
#define _TU16ATMRH_TU16ATMR12_POSN                          0x4
#define _TU16ATMRH_TU16ATMR12_POSITION                      0x4
#define _TU16ATMRH_TU16ATMR12_SIZE                          0x1
#define _TU16ATMRH_TU16ATMR12_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMR12_MASK                          0x10
#define _TU16ATMRH_TU16ATMR13_POSN                          0x5
#define _TU16ATMRH_TU16ATMR13_POSITION                      0x5
#define _TU16ATMRH_TU16ATMR13_SIZE                          0x1
#define _TU16ATMRH_TU16ATMR13_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMR13_MASK                          0x20
#define _TU16ATMRH_TU16ATMR14_POSN                          0x6
#define _TU16ATMRH_TU16ATMR14_POSITION                      0x6
#define _TU16ATMRH_TU16ATMR14_SIZE                          0x1
#define _TU16ATMRH_TU16ATMR14_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMR14_MASK                          0x40
#define _TU16ATMRH_TU16ATMR15_POSN                          0x7
#define _TU16ATMRH_TU16ATMR15_POSITION                      0x7
#define _TU16ATMRH_TU16ATMR15_SIZE                          0x1
#define _TU16ATMRH_TU16ATMR15_LENGTH                        0x1
#define _TU16ATMRH_TU16ATMR15_MASK                          0x80

// Register: TU16ACRH
#define TU16ACRH TU16ACRH
extern volatile unsigned char           TU16ACRH            __at(0x3A2);
#ifndef _LIB_BUILD
asm("TU16ACRH equ 03A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CRH                    :8;
    };
    struct {
        unsigned CRH0                   :1;
        unsigned CRH1                   :1;
        unsigned CRH2                   :1;
        unsigned CRH3                   :1;
        unsigned CRH4                   :1;
        unsigned CRH5                   :1;
        unsigned CRH6                   :1;
        unsigned CRH7                   :1;
    };
    struct {
        unsigned TU16ACRH0              :1;
        unsigned TU16ACRH1              :1;
        unsigned TU16ACRH2              :1;
        unsigned TU16ACRH3              :1;
        unsigned TU16ACRH4              :1;
        unsigned TU16ACRH5              :1;
        unsigned TU16ACRH6              :1;
        unsigned TU16ACRH7              :1;
    };
    struct {
        unsigned TU16ACR8               :1;
        unsigned TU16ACR9               :1;
        unsigned TU16ACR10              :1;
        unsigned TU16ACR11              :1;
        unsigned TU16ACR12              :1;
        unsigned TU16ACR13              :1;
        unsigned TU16ACR14              :1;
        unsigned TU16ACR15              :1;
    };
} TU16ACRHbits_t;
