garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
extern volatile TU16ATMRTbits_t TU16ATMRTbits __at(0x3A4);
// bitfield macros
#define _TU16ATMRT_TMRT_POSN                                0x0
#define _TU16ATMRT_TMRT_POSITION                            0x0
#define _TU16ATMRT_TMRT_SIZE                                0x8
#define _TU16ATMRT_TMRT_LENGTH                              0x8
#define _TU16ATMRT_TMRT_MASK                                0xFF
#define _TU16ATMRT_TMRT0_POSN                               0x0
#define _TU16ATMRT_TMRT0_POSITION                           0x0
#define _TU16ATMRT_TMRT0_SIZE                               0x1
#define _TU16ATMRT_TMRT0_LENGTH                             0x1
#define _TU16ATMRT_TMRT0_MASK                               0x1
#define _TU16ATMRT_TMRT1_POSN                               0x1
#define _TU16ATMRT_TMRT1_POSITION                           0x1
#define _TU16ATMRT_TMRT1_SIZE                               0x1
#define _TU16ATMRT_TMRT1_LENGTH                             0x1
#define _TU16ATMRT_TMRT1_MASK                               0x2
#define _TU16ATMRT_TMRT2_POSN                               0x2
#define _TU16ATMRT_TMRT2_POSITION                           0x2
#define _TU16ATMRT_TMRT2_SIZE                               0x1
#define _TU16ATMRT_TMRT2_LENGTH                             0x1
#define _TU16ATMRT_TMRT2_MASK                               0x4
#define _TU16ATMRT_TMRT3_POSN                               0x3
#define _TU16ATMRT_TMRT3_POSITION                           0x3
#define _TU16ATMRT_TMRT3_SIZE                               0x1
#define _TU16ATMRT_TMRT3_LENGTH                             0x1
#define _TU16ATMRT_TMRT3_MASK                               0x8
#define _TU16ATMRT_TMRT4_POSN                               0x4
#define _TU16ATMRT_TMRT4_POSITION                           0x4
#define _TU16ATMRT_TMRT4_SIZE                               0x1
#define _TU16ATMRT_TMRT4_LENGTH                             0x1
#define _TU16ATMRT_TMRT4_MASK                               0x10
#define _TU16ATMRT_TMRT5_POSN                               0x5
#define _TU16ATMRT_TMRT5_POSITION                           0x5
#define _TU16ATMRT_TMRT5_SIZE                               0x1
#define _TU16ATMRT_TMRT5_LENGTH                             0x1
#define _TU16ATMRT_TMRT5_MASK                               0x20
#define _TU16ATMRT_TMRT6_POSN                               0x6
#define _TU16ATMRT_TMRT6_POSITION                           0x6
#define _TU16ATMRT_TMRT6_SIZE                               0x1
#define _TU16ATMRT_TMRT6_LENGTH                             0x1
#define _TU16ATMRT_TMRT6_MASK                               0x40
#define _TU16ATMRT_TMRT7_POSN                               0x7
#define _TU16ATMRT_TMRT7_POSITION                           0x7
#define _TU16ATMRT_TMRT7_SIZE                               0x1
#define _TU16ATMRT_TMRT7_LENGTH                             0x1
#define _TU16ATMRT_TMRT7_MASK                               0x80
#define _TU16ATMRT_TU16ATMRT0_POSN                          0x0
#define _TU16ATMRT_TU16ATMRT0_POSITION                      0x0
#define _TU16ATMRT_TU16ATMRT0_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT0_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT0_MASK                          0x1
#define _TU16ATMRT_TU16ATMRT1_POSN                          0x1
#define _TU16ATMRT_TU16ATMRT1_POSITION                      0x1
#define _TU16ATMRT_TU16ATMRT1_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT1_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT1_MASK                          0x2
#define _TU16ATMRT_TU16ATMRT2_POSN                          0x2
#define _TU16ATMRT_TU16ATMRT2_POSITION                      0x2
#define _TU16ATMRT_TU16ATMRT2_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT2_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT2_MASK                          0x4
#define _TU16ATMRT_TU16ATMRT3_POSN                          0x3
#define _TU16ATMRT_TU16ATMRT3_POSITION                      0x3
#define _TU16ATMRT_TU16ATMRT3_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT3_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT3_MASK                          0x8
#define _TU16ATMRT_TU16ATMRT4_POSN                          0x4
#define _TU16ATMRT_TU16ATMRT4_POSITION                      0x4
#define _TU16ATMRT_TU16ATMRT4_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT4_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT4_MASK                          0x10
#define _TU16ATMRT_TU16ATMRT5_POSN                          0x5
#define _TU16ATMRT_TU16ATMRT5_POSITION                      0x5
#define _TU16ATMRT_TU16ATMRT5_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT5_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT5_MASK                          0x20
#define _TU16ATMRT_TU16ATMRT6_POSN                          0x6
#define _TU16ATMRT_TU16ATMRT6_POSITION                      0x6
#define _TU16ATMRT_TU16ATMRT6_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT6_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT6_MASK                          0x40
#define _TU16ATMRT_TU16ATMRT7_POSN                          0x7
#define _TU16ATMRT_TU16ATMRT7_POSITION                      0x7
#define _TU16ATMRT_TU16ATMRT7_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT7_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT7_MASK                          0x80
#define _TU16ATMRT_TU16ATMR24_POSN                          0x0
#define _TU16ATMRT_TU16ATMR24_POSITION                      0x0
#define _TU16ATMRT_TU16ATMR24_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR24_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR24_MASK                          0x1
#define _TU16ATMRT_TU16ATMR25_POSN                          0x1
#define _TU16ATMRT_TU16ATMR25_POSITION                      0x1
#define _TU16ATMRT_TU16ATMR25_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR25_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR25_MASK                          0x2
#define _TU16ATMRT_TU16ATMR26_POSN                          0x2
#define _TU16ATMRT_TU16ATMR26_POSITION                      0x2
#define _TU16ATMRT_TU16ATMR26_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR26_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR26_MASK                          0x4
#define _TU16ATMRT_TU16ATMR27_POSN                          0x3
#define _TU16ATMRT_TU16ATMR27_POSITION                      0x3
#define _TU16ATMRT_TU16ATMR27_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR27_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR27_MASK                          0x8
#define _TU16ATMRT_TU16ATMR28_POSN                          0x4
#define _TU16ATMRT_TU16ATMR28_POSITION                      0x4
#define _TU16ATMRT_TU16ATMR28_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR28_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR28_MASK                          0x10
#define _TU16ATMRT_TU16ATMR29_POSN                          0x5
#define _TU16ATMRT_TU16ATMR29_POSITION                      0x5
#define _TU16ATMRT_TU16ATMR29_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR29_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR29_MASK                          0x20
#define _TU16ATMRT_TU16ATMR30_POSN                          0x6
#define _TU16ATMRT_TU16ATMR30_POSITION                      0x6
#define _TU16ATMRT_TU16ATMR30_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR30_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR30_MASK                          0x40
#define _TU16ATMRT_TU16ATMR31_POSN                          0x7
#define _TU16ATMRT_TU16ATMR31_POSITION                      0x7
#define _TU16ATMRT_TU16ATMR31_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR31_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR31_MASK                          0x80

