garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
extern volatile TU16BCRTbits_t TU16BCRTbits __at(0x3B2);
// bitfield macros
#define _TU16BCRT_CRT_POSN                                  0x0
#define _TU16BCRT_CRT_POSITION                              0x0
#define _TU16BCRT_CRT_SIZE                                  0x8
#define _TU16BCRT_CRT_LENGTH                                0x8
#define _TU16BCRT_CRT_MASK                                  0xFF
#define _TU16BCRT_CRT0_POSN                                 0x0
#define _TU16BCRT_CRT0_POSITION                             0x0
#define _TU16BCRT_CRT0_SIZE                                 0x1
#define _TU16BCRT_CRT0_LENGTH                               0x1
#define _TU16BCRT_CRT0_MASK                                 0x1
#define _TU16BCRT_CRT1_POSN                                 0x1
#define _TU16BCRT_CRT1_POSITION                             0x1
#define _TU16BCRT_CRT1_SIZE                                 0x1
#define _TU16BCRT_CRT1_LENGTH                               0x1
#define _TU16BCRT_CRT1_MASK                                 0x2
#define _TU16BCRT_CRT2_POSN                                 0x2
#define _TU16BCRT_CRT2_POSITION                             0x2
#define _TU16BCRT_CRT2_SIZE                                 0x1
#define _TU16BCRT_CRT2_LENGTH                               0x1
#define _TU16BCRT_CRT2_MASK                                 0x4
#define _TU16BCRT_CRT3_POSN                                 0x3
#define _TU16BCRT_CRT3_POSITION                             0x3
#define _TU16BCRT_CRT3_SIZE                                 0x1
#define _TU16BCRT_CRT3_LENGTH                               0x1
#define _TU16BCRT_CRT3_MASK                                 0x8
#define _TU16BCRT_CRT4_POSN                                 0x4
#define _TU16BCRT_CRT4_POSITION                             0x4
#define _TU16BCRT_CRT4_SIZE                                 0x1
#define _TU16BCRT_CRT4_LENGTH                               0x1
#define _TU16BCRT_CRT4_MASK                                 0x10
#define _TU16BCRT_CRT5_POSN                                 0x5
#define _TU16BCRT_CRT5_POSITION                             0x5
#define _TU16BCRT_CRT5_SIZE                                 0x1
#define _TU16BCRT_CRT5_LENGTH                               0x1
#define _TU16BCRT_CRT5_MASK                                 0x20
#define _TU16BCRT_CRT6_POSN                                 0x6
#define _TU16BCRT_CRT6_POSITION                             0x6
#define _TU16BCRT_CRT6_SIZE                                 0x1
#define _TU16BCRT_CRT6_LENGTH                               0x1
#define _TU16BCRT_CRT6_MASK                                 0x40
#define _TU16BCRT_CRT7_POSN                                 0x7
#define _TU16BCRT_CRT7_POSITION                             0x7
#define _TU16BCRT_CRT7_SIZE                                 0x1
#define _TU16BCRT_CRT7_LENGTH                               0x1
#define _TU16BCRT_CRT7_MASK                                 0x80
#define _TU16BCRT_TU16BCRT0_POSN                            0x0
#define _TU16BCRT_TU16BCRT0_POSITION                        0x0
#define _TU16BCRT_TU16BCRT0_SIZE                            0x1
#define _TU16BCRT_TU16BCRT0_LENGTH                          0x1
#define _TU16BCRT_TU16BCRT0_MASK                            0x1
#define _TU16BCRT_TU16BCRT1_POSN                            0x1
#define _TU16BCRT_TU16BCRT1_POSITION                        0x1
#define _TU16BCRT_TU16BCRT1_SIZE                            0x1
#define _TU16BCRT_TU16BCRT1_LENGTH                          0x1
#define _TU16BCRT_TU16BCRT1_MASK                            0x2
#define _TU16BCRT_TU16BCRT2_POSN                            0x2
#define _TU16BCRT_TU16BCRT2_POSITION                        0x2
#define _TU16BCRT_TU16BCRT2_SIZE                            0x1
#define _TU16BCRT_TU16BCRT2_LENGTH                          0x1
#define _TU16BCRT_TU16BCRT2_MASK                            0x4
#define _TU16BCRT_TU16BCRT3_POSN                            0x3
#define _TU16BCRT_TU16BCRT3_POSITION                        0x3
#define _TU16BCRT_TU16BCRT3_SIZE                            0x1
#define _TU16BCRT_TU16BCRT3_LENGTH                          0x1
#define _TU16BCRT_TU16BCRT3_MASK                            0x8
#define _TU16BCRT_TU16BCRT4_POSN                            0x4
#define _TU16BCRT_TU16BCRT4_POSITION                        0x4
#define _TU16BCRT_TU16BCRT4_SIZE                            0x1
#define _TU16BCRT_TU16BCRT4_LENGTH                          0x1
#define _TU16BCRT_TU16BCRT4_MASK                            0x10
#define _TU16BCRT_TU16BCRT5_POSN                            0x5
#define _TU16BCRT_TU16BCRT5_POSITION                        0x5
#define _TU16BCRT_TU16BCRT5_SIZE                            0x1
#define _TU16BCRT_TU16BCRT5_LENGTH                          0x1
#define _TU16BCRT_TU16BCRT5_MASK                            0x20
#define _TU16BCRT_TU16BCRT6_POSN                            0x6
#define _TU16BCRT_TU16BCRT6_POSITION                        0x6
#define _TU16BCRT_TU16BCRT6_SIZE                            0x1
#define _TU16BCRT_TU16BCRT6_LENGTH                          0x1
#define _TU16BCRT_TU16BCRT6_MASK                            0x40
#define _TU16BCRT_TU16BCRT7_POSN                            0x7
#define _TU16BCRT_TU16BCRT7_POSITION                        0x7
#define _TU16BCRT_TU16BCRT7_SIZE                            0x1
#define _TU16BCRT_TU16BCRT7_LENGTH                          0x1
#define _TU16BCRT_TU16BCRT7_MASK                            0x80
#define _TU16BCRT_TU16BCR24_POSN                            0x0
#define _TU16BCRT_TU16BCR24_POSITION                        0x0
#define _TU16BCRT_TU16BCR24_SIZE                            0x1
#define _TU16BCRT_TU16BCR24_LENGTH                          0x1
#define _TU16BCRT_TU16BCR24_MASK                            0x1
#define _TU16BCRT_TU16BCR25_POSN                            0x1
#define _TU16BCRT_TU16BCR25_POSITION                        0x1
#define _TU16BCRT_TU16BCR25_SIZE                            0x1
#define _TU16BCRT_TU16BCR25_LENGTH                          0x1
#define _TU16BCRT_TU16BCR25_MASK                            0x2
#define _TU16BCRT_TU16BCR26_POSN                            0x2
#define _TU16BCRT_TU16BCR26_POSITION                        0x2
#define _TU16BCRT_TU16BCR26_SIZE                            0x1
#define _TU16BCRT_TU16BCR26_LENGTH                          0x1
#define _TU16BCRT_TU16BCR26_MASK                            0x4
#define _TU16BCRT_TU16BCR27_POSN                            0x3
#define _TU16BCRT_TU16BCR27_POSITION                        0x3
#define _TU16BCRT_TU16BCR27_SIZE                            0x1
#define _TU16BCRT_TU16BCR27_LENGTH                          0x1
#define _TU16BCRT_TU16BCR27_MASK                            0x8
#define _TU16BCRT_TU16BCR28_POSN                            0x4
#define _TU16BCRT_TU16BCR28_POSITION                        0x4
#define _TU16BCRT_TU16BCR28_SIZE                            0x1
#define _TU16BCRT_TU16BCR28_LENGTH                          0x1
#define _TU16BCRT_TU16BCR28_MASK                            0x10
#define _TU16BCRT_TU16BCR29_POSN                            0x5
#define _TU16BCRT_TU16BCR29_POSITION                        0x5
#define _TU16BCRT_TU16BCR29_SIZE                            0x1
#define _TU16BCRT_TU16BCR29_LENGTH                          0x1
#define _TU16BCRT_TU16BCR29_MASK                            0x20
#define _TU16BCRT_TU16BCR30_POSN                            0x6
#define _TU16BCRT_TU16BCR30_POSITION                        0x6
#define _TU16BCRT_TU16BCR30_SIZE                            0x1
#define _TU16BCRT_TU16BCR30_LENGTH                          0x1
#define _TU16BCRT_TU16BCR30_MASK                            0x40
#define _TU16BCRT_TU16BCR31_POSN                            0x7
#define _TU16BCRT_TU16BCR31_POSITION                        0x7
#define _TU16BCRT_TU16BCR31_SIZE                            0x1
#define _TU16BCRT_TU16BCR31_LENGTH                          0x1
#define _TU16BCRT_TU16BCR31_MASK                            0x80

// Register: TU16BPR
#define TU16BPR TU16BPR
extern volatile unsigned long           TU16BPR             __at(0x3B3);
#ifndef _LIB_BUILD
asm("TU16BPR equ 03B3h");
#endif

// Register: TU16BPRL
#define TU16BPRL TU16BPRL
extern volatile unsigned char           TU16BPRL            __at(0x3B3);
#ifndef _LIB_BUILD
asm("TU16BPRL equ 03B3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
    struct {
        unsigned PRL0                   :1;
        unsigned PRL1                   :1;
        unsigned PRL2                   :1;
        unsigned PRL3                   :1;
        unsigned PRL4                   :1;
        unsigned PRL5                   :1;
        unsigned PRL6                   :1;
        unsigned PRL7                   :1;
    };
    struct {
        unsigned TU16BPRL0              :1;
        unsigned TU16BPRL1              :1;
        unsigned TU16BPRL2              :1;
        unsigned TU16BPRL3              :1;
        unsigned TU16BPRL4              :1;
        unsigned TU16BPRL5              :1;
        unsigned TU16BPRL6              :1;
        unsigned TU16BPRL7              :1;
    };
    struct {
        unsigned TU16BPR0               :1;
        unsigned TU16BPR1               :1;
        unsigned TU16BPR2               :1;
        unsigned TU16BPR3               :1;
        unsigned TU16BPR4               :1;
        unsigned TU16BPR5               :1;
        unsigned TU16BPR6               :1;
        unsigned TU16BPR7               :1;
    };
} TU16BPRLbits_t;
extern volatile TU16BPRLbits_t TU16BPRLbits __at(0x3B3);
// bitfield macros
#define _TU16BPRL_PRL_POSN                                  0x0
#define _TU16BPRL_PRL_POSITION                              0x0
#define _TU16BPRL_PRL_SIZE                                  0x8
#define _TU16BPRL_PRL_LENGTH                                0x8
#define _TU16BPRL_PRL_MASK                                  0xFF
#define _TU16BPRL_PRL0_POSN                                 0x0
#define _TU16BPRL_PRL0_POSITION                             0x0
#define _TU16BPRL_PRL0_SIZE                                 0x1
#define _TU16BPRL_PRL0_LENGTH                               0x1
#define _TU16BPRL_PRL0_MASK                                 0x1
#define _TU16BPRL_PRL1_POSN                                 0x1
#define _TU16BPRL_PRL1_POSITION                             0x1
#define _TU16BPRL_PRL1_SIZE                                 0x1
#define _TU16BPRL_PRL1_LENGTH                               0x1
#define _TU16BPRL_PRL1_MASK                                 0x2
#define _TU16BPRL_PRL2_POSN                                 0x2
#define _TU16BPRL_PRL2_POSITION                             0x2
#define _TU16BPRL_PRL2_SIZE                                 0x1
#define _TU16BPRL_PRL2_LENGTH                               0x1
#define _TU16BPRL_PRL2_MASK                                 0x4
#define _TU16BPRL_PRL3_POSN                                 0x3
#define _TU16BPRL_PRL3_POSITION                             0x3
#define _TU16BPRL_PRL3_SIZE                                 0x1
#define _TU16BPRL_PRL3_LENGTH                               0x1
#define _TU16BPRL_PRL3_MASK                                 0x8
#define _TU16BPRL_PRL4_POSN                                 0x4
#define _TU16BPRL_PRL4_POSITION                             0x4
#define _TU16BPRL_PRL4_SIZE                                 0x1
#define _TU16BPRL_PRL4_LENGTH                               0x1
#define _TU16BPRL_PRL4_MASK                                 0x10
#define _TU16BPRL_PRL5_POSN                                 0x5
#define _TU16BPRL_PRL5_POSITION                             0x5
#define _TU16BPRL_PRL5_SIZE                                 0x1
#define _TU16BPRL_PRL5_LENGTH                               0x1
#define _TU16BPRL_PRL5_MASK                                 0x20
#define _TU16BPRL_PRL6_POSN                                 0x6
#define _TU16BPRL_PRL6_POSITION                             0x6
#define _TU16BPRL_PRL6_SIZE                                 0x1
#define _TU16BPRL_PRL6_LENGTH                               0x1
#define _TU16BPRL_PRL6_MASK                                 0x40
#define _TU16BPRL_PRL7_POSN                                 0x7
#define _TU16BPRL_PRL7_POSITION                             0x7
#define _TU16BPRL_PRL7_SIZE                                 0x1
#define _TU16BPRL_PRL7_LENGTH                               0x1
#define _TU16BPRL_PRL7_MASK                                 0x80
#define _TU16BPRL_TU16BPRL0_POSN                            0x0
#define _TU16BPRL_TU16BPRL0_POSITION                        0x0
#define _TU16BPRL_TU16BPRL0_SIZE                            0x1
#define _TU16BPRL_TU16BPRL0_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL0_MASK                            0x1
#define _TU16BPRL_TU16BPRL1_POSN                            0x1
#define _TU16BPRL_TU16BPRL1_POSITION                        0x1
#define _TU16BPRL_TU16BPRL1_SIZE                            0x1
#define _TU16BPRL_TU16BPRL1_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL1_MASK                            0x2
#define _TU16BPRL_TU16BPRL2_POSN                            0x2
#define _TU16BPRL_TU16BPRL2_POSITION                        0x2
#define _TU16BPRL_TU16BPRL2_SIZE                            0x1
#define _TU16BPRL_TU16BPRL2_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL2_MASK                            0x4
#define _TU16BPRL_TU16BPRL3_POSN                            0x3
#define _TU16BPRL_TU16BPRL3_POSITION                        0x3
#define _TU16BPRL_TU16BPRL3_SIZE                            0x1
#define _TU16BPRL_TU16BPRL3_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL3_MASK                            0x8
#define _TU16BPRL_TU16BPRL4_POSN                            0x4
#define _TU16BPRL_TU16BPRL4_POSITION                        0x4
#define _TU16BPRL_TU16BPRL4_SIZE                            0x1
#define _TU16BPRL_TU16BPRL4_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL4_MASK                            0x10
#define _TU16BPRL_TU16BPRL5_POSN                            0x5
#define _TU16BPRL_TU16BPRL5_POSITION                        0x5
#define _TU16BPRL_TU16BPRL5_SIZE                            0x1
#define _TU16BPRL_TU16BPRL5_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL5_MASK                            0x20
#define _TU16BPRL_TU16BPRL6_POSN                            0x6
#define _TU16BPRL_TU16BPRL6_POSITION                        0x6
#define _TU16BPRL_TU16BPRL6_SIZE                            0x1
#define _TU16BPRL_TU16BPRL6_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL6_MASK                            0x40
#define _TU16BPRL_TU16BPRL7_POSN                            0x7
#define _TU16BPRL_TU16BPRL7_POSITION                        0x7
#define _TU16BPRL_TU16BPRL7_SIZE                            0x1
#define _TU16BPRL_TU16BPRL7_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL7_MASK                            0x80
#define _TU16BPRL_TU16BPR0_POSN                             0x0
#define _TU16BPRL_TU16BPR0_POSITION                         0x0
#define _TU16BPRL_TU16BPR0_SIZE                             0x1
#define _TU16BPRL_TU16BPR0_LENGTH                           0x1
#define _TU16BPRL_TU16BPR0_MASK                             0x1
#define _TU16BPRL_TU16BPR1_POSN                             0x1
#define _TU16BPRL_TU16BPR1_POSITION                         0x1
#define _TU16BPRL_TU16BPR1_SIZE                             0x1
#define _TU16BPRL_TU16BPR1_LENGTH                           0x1
#define _TU16BPRL_TU16BPR1_MASK                             0x2
#define _TU16BPRL_TU16BPR2_POSN                             0x2
#define _TU16BPRL_TU16BPR2_POSITION                         0x2
#define _TU16BPRL_TU16BPR2_SIZE                             0x1
#define _TU16BPRL_TU16BPR2_LENGTH                           0x1
#define _TU16BPRL_TU16BPR2_MASK                             0x4
#define _TU16BPRL_TU16BPR3_POSN                             0x3
#define _TU16BPRL_TU16BPR3_POSITION                         0x3
#define _TU16BPRL_TU16BPR3_SIZE                             0x1
#define _TU16BPRL_TU16BPR3_LENGTH                           0x1
#define _TU16BPRL_TU16BPR3_MASK                             0x8
#define _TU16BPRL_TU16BPR4_POSN                             0x4
#define _TU16BPRL_TU16BPR4_POSITION                         0x4
#define _TU16BPRL_TU16BPR4_SIZE                             0x1
#define _TU16BPRL_TU16BPR4_LENGTH                           0x1
#define _TU16BPRL_TU16BPR4_MASK                             0x10
#define _TU16BPRL_TU16BPR5_POSN                             0x5
#define _TU16BPRL_TU16BPR5_POSITION                         0x5
#define _TU16BPRL_TU16BPR5_SIZE                             0x1
#define _TU16BPRL_TU16BPR5_LENGTH                           0x1
#define _TU16BPRL_TU16BPR5_MASK                             0x20
#define _TU16BPRL_TU16BPR6_POSN                             0x6
#define _TU16BPRL_TU16BPR6_POSITION                         0x6
#define _TU16BPRL_TU16BPR6_SIZE                             0x1
#define _TU16BPRL_TU16BPR6_LENGTH                           0x1
#define _TU16BPRL_TU16BPR6_MASK                             0x40
#define _TU16BPRL_TU16BPR7_POSN                             0x7
#define _TU16BPRL_TU16BPR7_POSITION                         0x7
#define _TU16BPRL_TU16BPR7_SIZE                             0x1
#define _TU16BPRL_TU16BPR7_LENGTH                           0x1
#define _TU16BPRL_TU16BPR7_MASK                             0x80

