garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
// Register: ODCOND
#define ODCOND ODCOND
extern volatile unsigned char           ODCOND              __at(0x41A);
#ifndef _LIB_BUILD
asm("ODCOND equ 041Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCD0                  :1;
        unsigned ODCD1                  :1;
        unsigned ODCD2                  :1;
        unsigned ODCD3                  :1;
        unsigned ODCD4                  :1;
        unsigned ODCD5                  :1;
        unsigned ODCD6                  :1;
        unsigned ODCD7                  :1;
    };
} ODCONDbits_t;
extern volatile ODCONDbits_t ODCONDbits __at(0x41A);
// bitfield macros
#define _ODCOND_ODCD0_POSN                                  0x0
#define _ODCOND_ODCD0_POSITION                              0x0
#define _ODCOND_ODCD0_SIZE                                  0x1
#define _ODCOND_ODCD0_LENGTH                                0x1
#define _ODCOND_ODCD0_MASK                                  0x1
#define _ODCOND_ODCD1_POSN                                  0x1
#define _ODCOND_ODCD1_POSITION                              0x1
#define _ODCOND_ODCD1_SIZE                                  0x1
#define _ODCOND_ODCD1_LENGTH                                0x1
#define _ODCOND_ODCD1_MASK                                  0x2
#define _ODCOND_ODCD2_POSN                                  0x2
#define _ODCOND_ODCD2_POSITION                              0x2
#define _ODCOND_ODCD2_SIZE                                  0x1
#define _ODCOND_ODCD2_LENGTH                                0x1
#define _ODCOND_ODCD2_MASK                                  0x4
#define _ODCOND_ODCD3_POSN                                  0x3
#define _ODCOND_ODCD3_POSITION                              0x3
#define _ODCOND_ODCD3_SIZE                                  0x1
#define _ODCOND_ODCD3_LENGTH                                0x1
#define _ODCOND_ODCD3_MASK                                  0x8
#define _ODCOND_ODCD4_POSN                                  0x4
#define _ODCOND_ODCD4_POSITION                              0x4
#define _ODCOND_ODCD4_SIZE                                  0x1
#define _ODCOND_ODCD4_LENGTH                                0x1
#define _ODCOND_ODCD4_MASK                                  0x10
#define _ODCOND_ODCD5_POSN                                  0x5
#define _ODCOND_ODCD5_POSITION                              0x5
#define _ODCOND_ODCD5_SIZE                                  0x1
#define _ODCOND_ODCD5_LENGTH                                0x1
#define _ODCOND_ODCD5_MASK                                  0x20
#define _ODCOND_ODCD6_POSN                                  0x6
#define _ODCOND_ODCD6_POSITION                              0x6
#define _ODCOND_ODCD6_SIZE                                  0x1
#define _ODCOND_ODCD6_LENGTH                                0x1
#define _ODCOND_ODCD6_MASK                                  0x40
#define _ODCOND_ODCD7_POSN                                  0x7
#define _ODCOND_ODCD7_POSITION                              0x7
#define _ODCOND_ODCD7_SIZE                                  0x1
#define _ODCOND_ODCD7_LENGTH                                0x1
#define _ODCOND_ODCD7_MASK                                  0x80

// Register: SLRCOND
#define SLRCOND SLRCOND
extern volatile unsigned char           SLRCOND             __at(0x41B);
#ifndef _LIB_BUILD
asm("SLRCOND equ 041Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRD0                  :1;
        unsigned SLRD1                  :1;
        unsigned SLRD2                  :1;
        unsigned SLRD3                  :1;
        unsigned SLRD4                  :1;
        unsigned SLRD5                  :1;
        unsigned SLRD6                  :1;
        unsigned SLRD7                  :1;
    };
} SLRCONDbits_t;
extern volatile SLRCONDbits_t SLRCONDbits __at(0x41B);
// bitfield macros
#define _SLRCOND_SLRD0_POSN                                 0x0
#define _SLRCOND_SLRD0_POSITION                             0x0
#define _SLRCOND_SLRD0_SIZE                                 0x1
#define _SLRCOND_SLRD0_LENGTH                               0x1
#define _SLRCOND_SLRD0_MASK                                 0x1
#define _SLRCOND_SLRD1_POSN                                 0x1
#define _SLRCOND_SLRD1_POSITION                             0x1
#define _SLRCOND_SLRD1_SIZE                                 0x1
#define _SLRCOND_SLRD1_LENGTH                               0x1
#define _SLRCOND_SLRD1_MASK                                 0x2
#define _SLRCOND_SLRD2_POSN                                 0x2
#define _SLRCOND_SLRD2_POSITION                             0x2
#define _SLRCOND_SLRD2_SIZE                                 0x1
#define _SLRCOND_SLRD2_LENGTH                               0x1
#define _SLRCOND_SLRD2_MASK                                 0x4
#define _SLRCOND_SLRD3_POSN                                 0x3
#define _SLRCOND_SLRD3_POSITION                             0x3
#define _SLRCOND_SLRD3_SIZE                                 0x1
#define _SLRCOND_SLRD3_LENGTH                               0x1
#define _SLRCOND_SLRD3_MASK                                 0x8
#define _SLRCOND_SLRD4_POSN                                 0x4
#define _SLRCOND_SLRD4_POSITION                             0x4
#define _SLRCOND_SLRD4_SIZE                                 0x1
#define _SLRCOND_SLRD4_LENGTH                               0x1
#define _SLRCOND_SLRD4_MASK                                 0x10
#define _SLRCOND_SLRD5_POSN                                 0x5
#define _SLRCOND_SLRD5_POSITION                             0x5
#define _SLRCOND_SLRD5_SIZE                                 0x1
#define _SLRCOND_SLRD5_LENGTH                               0x1
#define _SLRCOND_SLRD5_MASK                                 0x20
#define _SLRCOND_SLRD6_POSN                                 0x6
#define _SLRCOND_SLRD6_POSITION                             0x6
#define _SLRCOND_SLRD6_SIZE                                 0x1
#define _SLRCOND_SLRD6_LENGTH                               0x1
#define _SLRCOND_SLRD6_MASK                                 0x40
#define _SLRCOND_SLRD7_POSN                                 0x7
#define _SLRCOND_SLRD7_POSITION                             0x7
#define _SLRCOND_SLRD7_SIZE                                 0x1
#define _SLRCOND_SLRD7_LENGTH                               0x1
#define _SLRCOND_SLRD7_MASK                                 0x80

// Register: INLVLD
#define INLVLD INLVLD
extern volatile unsigned char           INLVLD              __at(0x41C);
#ifndef _LIB_BUILD
asm("INLVLD equ 041Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLD0                :1;
        unsigned INLVLD1                :1;
        unsigned INLVLD2                :1;
        unsigned INLVLD3                :1;
        unsigned INLVLD4                :1;
        unsigned INLVLD5                :1;
        unsigned INLVLD6                :1;
        unsigned INLVLD7                :1;
    };
} INLVLDbits_t;
extern volatile INLVLDbits_t INLVLDbits __at(0x41C);
// bitfield macros
#define _INLVLD_INLVLD0_POSN                                0x0
#define _INLVLD_INLVLD0_POSITION                            0x0
#define _INLVLD_INLVLD0_SIZE                                0x1
#define _INLVLD_INLVLD0_LENGTH                              0x1
#define _INLVLD_INLVLD0_MASK                                0x1
#define _INLVLD_INLVLD1_POSN                                0x1
#define _INLVLD_INLVLD1_POSITION                            0x1
#define _INLVLD_INLVLD1_SIZE                                0x1
#define _INLVLD_INLVLD1_LENGTH                              0x1
#define _INLVLD_INLVLD1_MASK                                0x2
#define _INLVLD_INLVLD2_POSN                                0x2
#define _INLVLD_INLVLD2_POSITION                            0x2
#define _INLVLD_INLVLD2_SIZE                                0x1
#define _INLVLD_INLVLD2_LENGTH                              0x1
#define _INLVLD_INLVLD2_MASK                                0x4
#define _INLVLD_INLVLD3_POSN                                0x3
#define _INLVLD_INLVLD3_POSITION                            0x3
#define _INLVLD_INLVLD3_SIZE                                0x1
#define _INLVLD_INLVLD3_LENGTH                              0x1
#define _INLVLD_INLVLD3_MASK                                0x8
#define _INLVLD_INLVLD4_POSN                                0x4
#define _INLVLD_INLVLD4_POSITION                            0x4
#define _INLVLD_INLVLD4_SIZE                                0x1
#define _INLVLD_INLVLD4_LENGTH                              0x1
#define _INLVLD_INLVLD4_MASK                                0x10
#define _INLVLD_INLVLD5_POSN                                0x5
#define _INLVLD_INLVLD5_POSITION                            0x5
#define _INLVLD_INLVLD5_SIZE                                0x1
#define _INLVLD_INLVLD5_LENGTH                              0x1
#define _INLVLD_INLVLD5_MASK                                0x20
#define _INLVLD_INLVLD6_POSN                                0x6
#define _INLVLD_INLVLD6_POSITION                            0x6
#define _INLVLD_INLVLD6_SIZE                                0x1
#define _INLVLD_INLVLD6_LENGTH                              0x1
#define _INLVLD_INLVLD6_MASK                                0x40
#define _INLVLD_INLVLD7_POSN                                0x7
#define _INLVLD_INLVLD7_POSITION                            0x7
#define _INLVLD_INLVLD7_SIZE                                0x1
#define _INLVLD_INLVLD7_LENGTH                              0x1
#define _INLVLD_INLVLD7_MASK                                0x80

