garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x4AE);
#ifndef _LIB_BUILD
asm("PIE4 equ 04AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIE                 :1;
        unsigned U1TXIE                 :1;
        unsigned U1EIE                  :1;
        unsigned U1IE                   :1;
        unsigned TMR3IE                 :1;
        unsigned TMR3GIE                :1;
        unsigned PWM1PIE                :1;
        unsigned PWM1IE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x4AE);
// bitfield macros
#define _PIE4_U1RXIE_POSN                                   0x0
#define _PIE4_U1RXIE_POSITION                               0x0
#define _PIE4_U1RXIE_SIZE                                   0x1
#define _PIE4_U1RXIE_LENGTH                                 0x1
#define _PIE4_U1RXIE_MASK                                   0x1
#define _PIE4_U1TXIE_POSN                                   0x1
#define _PIE4_U1TXIE_POSITION                               0x1
#define _PIE4_U1TXIE_SIZE                                   0x1
#define _PIE4_U1TXIE_LENGTH                                 0x1
#define _PIE4_U1TXIE_MASK                                   0x2
#define _PIE4_U1EIE_POSN                                    0x2
#define _PIE4_U1EIE_POSITION                                0x2
#define _PIE4_U1EIE_SIZE                                    0x1
#define _PIE4_U1EIE_LENGTH                                  0x1
#define _PIE4_U1EIE_MASK                                    0x4
#define _PIE4_U1IE_POSN                                     0x3
#define _PIE4_U1IE_POSITION                                 0x3
#define _PIE4_U1IE_SIZE                                     0x1
#define _PIE4_U1IE_LENGTH                                   0x1
#define _PIE4_U1IE_MASK                                     0x8
#define _PIE4_TMR3IE_POSN                                   0x4
#define _PIE4_TMR3IE_POSITION                               0x4
#define _PIE4_TMR3IE_SIZE                                   0x1
#define _PIE4_TMR3IE_LENGTH                                 0x1
#define _PIE4_TMR3IE_MASK                                   0x10
#define _PIE4_TMR3GIE_POSN                                  0x5
#define _PIE4_TMR3GIE_POSITION                              0x5
#define _PIE4_TMR3GIE_SIZE                                  0x1
#define _PIE4_TMR3GIE_LENGTH                                0x1
#define _PIE4_TMR3GIE_MASK                                  0x20
#define _PIE4_PWM1PIE_POSN                                  0x6
#define _PIE4_PWM1PIE_POSITION                              0x6
#define _PIE4_PWM1PIE_SIZE                                  0x1
#define _PIE4_PWM1PIE_LENGTH                                0x1
#define _PIE4_PWM1PIE_MASK                                  0x40
#define _PIE4_PWM1IE_POSN                                   0x7
#define _PIE4_PWM1IE_POSITION                               0x7
#define _PIE4_PWM1IE_SIZE                                   0x1
#define _PIE4_PWM1IE_LENGTH                                 0x1
#define _PIE4_PWM1IE_MASK                                   0x80

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x4AF);
#ifndef _LIB_BUILD
asm("PIE5 equ 04AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CLC6IE                 :1;
        unsigned TU16AIE                :1;
        unsigned TMR6IE                 :1;
        unsigned C2IE                   :1;
        unsigned CLC2IE                 :1;
        unsigned PWM2PIE                :1;
        unsigned PWM2IE                 :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x4AF);
// bitfield macros
#define _PIE5_CLC6IE_POSN                                   0x1
#define _PIE5_CLC6IE_POSITION                               0x1
#define _PIE5_CLC6IE_SIZE                                   0x1
#define _PIE5_CLC6IE_LENGTH                                 0x1
#define _PIE5_CLC6IE_MASK                                   0x2
#define _PIE5_TU16AIE_POSN                                  0x2
#define _PIE5_TU16AIE_POSITION                              0x2
#define _PIE5_TU16AIE_SIZE                                  0x1
#define _PIE5_TU16AIE_LENGTH                                0x1
#define _PIE5_TU16AIE_MASK                                  0x4
#define _PIE5_TMR6IE_POSN                                   0x3
#define _PIE5_TMR6IE_POSITION                               0x3
#define _PIE5_TMR6IE_SIZE                                   0x1
#define _PIE5_TMR6IE_LENGTH                                 0x1
#define _PIE5_TMR6IE_MASK                                   0x8
#define _PIE5_C2IE_POSN                                     0x4
#define _PIE5_C2IE_POSITION                                 0x4
#define _PIE5_C2IE_SIZE                                     0x1
#define _PIE5_C2IE_LENGTH                                   0x1
#define _PIE5_C2IE_MASK                                     0x10
#define _PIE5_CLC2IE_POSN                                   0x5
#define _PIE5_CLC2IE_POSITION                               0x5
#define _PIE5_CLC2IE_SIZE                                   0x1
#define _PIE5_CLC2IE_LENGTH                                 0x1
#define _PIE5_CLC2IE_MASK                                   0x20
#define _PIE5_PWM2PIE_POSN                                  0x6
#define _PIE5_PWM2PIE_POSITION                              0x6
#define _PIE5_PWM2PIE_SIZE                                  0x1
#define _PIE5_PWM2PIE_LENGTH                                0x1
#define _PIE5_PWM2PIE_MASK                                  0x40
#define _PIE5_PWM2IE_POSN                                   0x7
#define _PIE5_PWM2IE_POSITION                               0x7
#define _PIE5_PWM2IE_SIZE                                   0x1
#define _PIE5_PWM2IE_LENGTH                                 0x1
#define _PIE5_PWM2IE_MASK                                   0x80

