garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0x4BD);
#ifndef _LIB_BUILD
asm("PIR7 equ 04BDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1RXIF               :1;
        unsigned I2C1TXIF               :1;
        unsigned I2C1IF                 :1;
        unsigned I2C1EIF                :1;
        unsigned                        :1;
        unsigned CLC3IF                 :1;
        unsigned PWM3PIF                :1;
        unsigned PWM3IF                 :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0x4BD);
// bitfield macros
#define _PIR7_I2C1RXIF_POSN                                 0x0
#define _PIR7_I2C1RXIF_POSITION                             0x0
#define _PIR7_I2C1RXIF_SIZE                                 0x1
#define _PIR7_I2C1RXIF_LENGTH                               0x1
#define _PIR7_I2C1RXIF_MASK                                 0x1
#define _PIR7_I2C1TXIF_POSN                                 0x1
#define _PIR7_I2C1TXIF_POSITION                             0x1
#define _PIR7_I2C1TXIF_SIZE                                 0x1
#define _PIR7_I2C1TXIF_LENGTH                               0x1
#define _PIR7_I2C1TXIF_MASK                                 0x2
#define _PIR7_I2C1IF_POSN                                   0x2
#define _PIR7_I2C1IF_POSITION                               0x2
#define _PIR7_I2C1IF_SIZE                                   0x1
#define _PIR7_I2C1IF_LENGTH                                 0x1
#define _PIR7_I2C1IF_MASK                                   0x4
#define _PIR7_I2C1EIF_POSN                                  0x3
#define _PIR7_I2C1EIF_POSITION                              0x3
#define _PIR7_I2C1EIF_SIZE                                  0x1
#define _PIR7_I2C1EIF_LENGTH                                0x1
#define _PIR7_I2C1EIF_MASK                                  0x8
#define _PIR7_CLC3IF_POSN                                   0x5
#define _PIR7_CLC3IF_POSITION                               0x5
#define _PIR7_CLC3IF_SIZE                                   0x1
#define _PIR7_CLC3IF_LENGTH                                 0x1
#define _PIR7_CLC3IF_MASK                                   0x20
#define _PIR7_PWM3PIF_POSN                                  0x6
#define _PIR7_PWM3PIF_POSITION                              0x6
#define _PIR7_PWM3PIF_SIZE                                  0x1
#define _PIR7_PWM3PIF_LENGTH                                0x1
#define _PIR7_PWM3PIF_MASK                                  0x40
#define _PIR7_PWM3IF_POSN                                   0x7
#define _PIR7_PWM3IF_POSITION                               0x7
#define _PIR7_PWM3IF_SIZE                                   0x1
#define _PIR7_PWM3IF_LENGTH                                 0x1
#define _PIR7_PWM3IF_MASK                                   0x80

// Register: PIR8
#define PIR8 PIR8
extern volatile unsigned char           PIR8                __at(0x4BE);
#ifndef _LIB_BUILD
asm("PIR8 equ 04BEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXIF                 :1;
        unsigned U2TXIF                 :1;
        unsigned U2EIF                  :1;
        unsigned U2IF                   :1;
        unsigned                        :1;
        unsigned CLC4IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned SCANIF                 :1;
    };
} PIR8bits_t;
extern volatile PIR8bits_t PIR8bits __at(0x4BE);
// bitfield macros
#define _PIR8_U2RXIF_POSN                                   0x0
#define _PIR8_U2RXIF_POSITION                               0x0
#define _PIR8_U2RXIF_SIZE                                   0x1
#define _PIR8_U2RXIF_LENGTH                                 0x1
#define _PIR8_U2RXIF_MASK                                   0x1
#define _PIR8_U2TXIF_POSN                                   0x1
#define _PIR8_U2TXIF_POSITION                               0x1
#define _PIR8_U2TXIF_SIZE                                   0x1
#define _PIR8_U2TXIF_LENGTH                                 0x1
#define _PIR8_U2TXIF_MASK                                   0x2
#define _PIR8_U2EIF_POSN                                    0x2
#define _PIR8_U2EIF_POSITION                                0x2
#define _PIR8_U2EIF_SIZE                                    0x1
#define _PIR8_U2EIF_LENGTH                                  0x1
#define _PIR8_U2EIF_MASK                                    0x4
#define _PIR8_U2IF_POSN                                     0x3
#define _PIR8_U2IF_POSITION                                 0x3
#define _PIR8_U2IF_SIZE                                     0x1
#define _PIR8_U2IF_LENGTH                                   0x1
#define _PIR8_U2IF_MASK                                     0x8
#define _PIR8_CLC4IF_POSN                                   0x5
#define _PIR8_CLC4IF_POSITION                               0x5
#define _PIR8_CLC4IF_SIZE                                   0x1
#define _PIR8_CLC4IF_LENGTH                                 0x1
#define _PIR8_CLC4IF_MASK                                   0x20
#define _PIR8_CCP2IF_POSN                                   0x6
#define _PIR8_CCP2IF_POSITION                               0x6
#define _PIR8_CCP2IF_SIZE                                   0x1
#define _PIR8_CCP2IF_LENGTH                                 0x1
#define _PIR8_CCP2IF_MASK                                   0x40
#define _PIR8_SCANIF_POSN                                   0x7
#define _PIR8_SCANIF_POSITION                               0x7
#define _PIR8_SCANIF_SIZE                                   0x1
#define _PIR8_SCANIF_LENGTH                                 0x1
#define _PIR8_SCANIF_MASK                                   0x80

// Register: PIR9
#define PIR9 PIR9
extern volatile unsigned char           PIR9                __at(0x4BF);
#ifndef _LIB_BUILD
asm("PIR9 equ 04BFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IF                   :1;
        unsigned                        :3;
        unsigned DMA3SCNTIF             :1;
        unsigned DMA3DCNTIF             :1;
        unsigned DMA3ORIF               :1;
        unsigned DMA3AIF                :1;
    };
} PIR9bits_t;
extern volatile PIR9bits_t PIR9bits __at(0x4BF);
// bitfield macros
#define _PIR9_C1IF_POSN                                     0x0
#define _PIR9_C1IF_POSITION                                 0x0
#define _PIR9_C1IF_SIZE                                     0x1
#define _PIR9_C1IF_LENGTH                                   0x1
#define _PIR9_C1IF_MASK                                     0x1
#define _PIR9_DMA3SCNTIF_POSN                               0x4
#define _PIR9_DMA3SCNTIF_POSITION                           0x4
#define _PIR9_DMA3SCNTIF_SIZE                               0x1
#define _PIR9_DMA3SCNTIF_LENGTH                             0x1
#define _PIR9_DMA3SCNTIF_MASK                               0x10
#define _PIR9_DMA3DCNTIF_POSN                               0x5
#define _PIR9_DMA3DCNTIF_POSITION                           0x5
#define _PIR9_DMA3DCNTIF_SIZE                               0x1
#define _PIR9_DMA3DCNTIF_LENGTH                             0x1
#define _PIR9_DMA3DCNTIF_MASK                               0x20
#define _PIR9_DMA3ORIF_POSN                                 0x6
#define _PIR9_DMA3ORIF_POSITION                             0x6
#define _PIR9_DMA3ORIF_SIZE                                 0x1
#define _PIR9_DMA3ORIF_LENGTH                               0x1
#define _PIR9_DMA3ORIF_MASK                                 0x40
#define _PIR9_DMA3AIF_POSN                                  0x7
#define _PIR9_DMA3AIF_POSITION                              0x7
#define _PIR9_DMA3AIF_SIZE                                  0x1
#define _PIR9_DMA3AIF_LENGTH                                0x1
#define _PIR9_DMA3AIF_MASK                                  0x80

// Register: PIR10
#define PIR10 PIR10
extern volatile unsigned char           PIR10               __at(0x4C0);
#ifndef _LIB_BUILD
asm("PIR10 equ 04C0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2IF                 :1;
        unsigned CLC8IF                 :1;
        unsigned TU16BIF                :1;
        unsigned TMR4IF                 :1;
        unsigned DMA4SCNTIF             :1;
        unsigned DMA4DCNTIF             :1;
        unsigned DMA4ORIF               :1;
        unsigned DMA4AIF                :1;
    };
} PIR10bits_t;
extern volatile PIR10bits_t PIR10bits __at(0x4C0);
// bitfield macros
#define _PIR10_INT2IF_POSN                                  0x0
#define _PIR10_INT2IF_POSITION                              0x0
#define _PIR10_INT2IF_SIZE                                  0x1
#define _PIR10_INT2IF_LENGTH                                0x1
#define _PIR10_INT2IF_MASK                                  0x1
#define _PIR10_CLC8IF_POSN                                  0x1
#define _PIR10_CLC8IF_POSITION                              0x1
#define _PIR10_CLC8IF_SIZE                                  0x1
#define _PIR10_CLC8IF_LENGTH                                0x1
#define _PIR10_CLC8IF_MASK                                  0x2
#define _PIR10_TU16BIF_POSN                                 0x2
#define _PIR10_TU16BIF_POSITION                             0x2
#define _PIR10_TU16BIF_SIZE                                 0x1
#define _PIR10_TU16BIF_LENGTH                               0x1
#define _PIR10_TU16BIF_MASK                                 0x4
#define _PIR10_TMR4IF_POSN                                  0x3
#define _PIR10_TMR4IF_POSITION                              0x3
#define _PIR10_TMR4IF_SIZE                                  0x1
#define _PIR10_TMR4IF_LENGTH                                0x1
#define _PIR10_TMR4IF_MASK                                  0x8
#define _PIR10_DMA4SCNTIF_POSN                              0x4
#define _PIR10_DMA4SCNTIF_POSITION                          0x4
#define _PIR10_DMA4SCNTIF_SIZE                              0x1
#define _PIR10_DMA4SCNTIF_LENGTH                            0x1
#define _PIR10_DMA4SCNTIF_MASK                              0x10
#define _PIR10_DMA4DCNTIF_POSN                              0x5
#define _PIR10_DMA4DCNTIF_POSITION                          0x5
#define _PIR10_DMA4DCNTIF_SIZE                              0x1
#define _PIR10_DMA4DCNTIF_LENGTH                            0x1
#define _PIR10_DMA4DCNTIF_MASK                              0x20
#define _PIR10_DMA4ORIF_POSN                                0x6
#define _PIR10_DMA4ORIF_POSITION                            0x6
#define _PIR10_DMA4ORIF_SIZE                                0x1
#define _PIR10_DMA4ORIF_LENGTH                              0x1
#define _PIR10_DMA4ORIF_MASK                                0x40
#define _PIR10_DMA4AIF_POSN                                 0x7
#define _PIR10_DMA4AIF_POSITION                             0x7
#define _PIR10_DMA4AIF_SIZE                                 0x1
#define _PIR10_DMA4AIF_LENGTH                               0x1
#define _PIR10_DMA4AIF_MASK                                 0x80

// Register: PIR11
#define PIR11 PIR11
extern volatile unsigned char           PIR11               __at(0x4C1);
#ifndef _LIB_BUILD
asm("PIR11 equ 04C1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI2RXIF               :1;
        unsigned SPI2TXIF               :1;
        unsigned SPI2IF                 :1;
        unsigned VDDIO2LVDIF            :1;
        unsigned VDDIO2nRDYIF           :1;
    };
} PIR11bits_t;
