garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f45q24.h
extern volatile __bit                   P3H                 __at(0x15F8);	// @ (0x2BF * 8 + 0)
#define                                 P3H_bit             _BIT_ACCESS(U1P3H,0)
// I2C1PIE<PC1IE>
extern volatile __bit                   PC1IE               __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 PC1IE_bit           _BIT_ACCESS(I2C1PIE,2)
// I2C1PIR<PC1IF>
extern volatile __bit                   PC1IF               __at(0x14CA);	// @ (0x299 * 8 + 2)
#define                                 PC1IF_bit           _BIT_ACCESS(I2C1PIR,2)
// I2C2PIE<PC2IE>
extern volatile __bit                   PC2IE               __at(0x158A);	// @ (0x2B1 * 8 + 2)
#define                                 PC2IE_bit           _BIT_ACCESS(I2C2PIE,2)
// I2C2PIR<PC2IF>
extern volatile __bit                   PC2IF               __at(0x1582);	// @ (0x2B0 * 8 + 2)
#define                                 PC2IF_bit           _BIT_ACCESS(I2C2PIR,2)
// ADCON1<PCSC>
extern volatile __bit                   PCSC                __at(0x1FA1);	// @ (0x3F4 * 8 + 1)
#define                                 PCSC_bit            _BIT_ACCESS(ADCON1,1)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2230);	// @ (0x446 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0x1AB8);	// @ (0x357 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0x1AB9);	// @ (0x357 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0x1ABA);	// @ (0x357 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0x1ABB);	// @ (0x357 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// CRCCON1<PLEN4>
extern volatile __bit                   PLEN4               __at(0x1ABC);	// @ (0x357 * 8 + 4)
#define                                 PLEN4_bit           _BIT_ACCESS(CRCCON1,4)
// OSCEN<PLLEN>
extern volatile __bit                   PLLEN               __at(0x598);	// @ (0xB3 * 8 + 0)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCEN,0)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x590);	// @ (0xB2 * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// VREGCON<PMSYS0>
extern volatile __bit                   PMSYS0              __at(0x244);	// @ (0x48 * 8 + 4)
#define                                 PMSYS0_bit          _BIT_ACCESS(VREGCON,4)
// VREGCON<PMSYS1>
extern volatile __bit                   PMSYS1              __at(0x245);	// @ (0x48 * 8 + 5)
#define                                 PMSYS1_bit          _BIT_ACCESS(VREGCON,5)
// CWG1CON1<POLA>
extern volatile __bit                   POLA                __at(0x1E08);	// @ (0x3C1 * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<POLB>
extern volatile __bit                   POLB                __at(0x1E09);	// @ (0x3C1 * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<POLC>
extern volatile __bit                   POLC                __at(0x1E0A);	// @ (0x3C1 * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<POLD>
extern volatile __bit                   POLD                __at(0x1E0B);	// @ (0x3C1 * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(CWG1CON1,3)
// PCON0<POR>
extern volatile __bit                   POR                 __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(PCON0,1)
// PORTWCLKPPS<PORTWCLKPPS0>
extern volatile __bit                   PORTWCLKPPS0        __at(0x13F8);	// @ (0x27F * 8 + 0)
#define                                 PORTWCLKPPS0_bit    _BIT_ACCESS(PORTWCLKPPS,0)
// PORTWCLKPPS<PORTWCLKPPS1>
extern volatile __bit                   PORTWCLKPPS1        __at(0x13F9);	// @ (0x27F * 8 + 1)
#define                                 PORTWCLKPPS1_bit    _BIT_ACCESS(PORTWCLKPPS,1)
// PORTWCLKPPS<PORTWCLKPPS2>
extern volatile __bit                   PORTWCLKPPS2        __at(0x13FA);	// @ (0x27F * 8 + 2)
#define                                 PORTWCLKPPS2_bit    _BIT_ACCESS(PORTWCLKPPS,2)
// PORTWCLKPPS<PORTWCLKPPS3>
extern volatile __bit                   PORTWCLKPPS3        __at(0x13FB);	// @ (0x27F * 8 + 3)
#define                                 PORTWCLKPPS3_bit    _BIT_ACCESS(PORTWCLKPPS,3)
// PORTWCLKPPS<PORTWCLKPPS4>
extern volatile __bit                   PORTWCLKPPS4        __at(0x13FC);	// @ (0x27F * 8 + 4)
#define                                 PORTWCLKPPS4_bit    _BIT_ACCESS(PORTWCLKPPS,4)
// PORTWCLKPPS<PORTWCLKPPS5>
extern volatile __bit                   PORTWCLKPPS5        __at(0x13FD);	// @ (0x27F * 8 + 5)
#define                                 PORTWCLKPPS5_bit    _BIT_ACCESS(PORTWCLKPPS,5)
// PORTWIN0PPS<PORTWIN0PPS0>
extern volatile __bit                   PORTWIN0PPS0        __at(0x13E8);	// @ (0x27D * 8 + 0)
#define                                 PORTWIN0PPS0_bit    _BIT_ACCESS(PORTWIN0PPS,0)
// PORTWIN0PPS<PORTWIN0PPS1>
extern volatile __bit                   PORTWIN0PPS1        __at(0x13E9);	// @ (0x27D * 8 + 1)
#define                                 PORTWIN0PPS1_bit    _BIT_ACCESS(PORTWIN0PPS,1)
// PORTWIN0PPS<PORTWIN0PPS2>
extern volatile __bit                   PORTWIN0PPS2        __at(0x13EA);	// @ (0x27D * 8 + 2)
#define                                 PORTWIN0PPS2_bit    _BIT_ACCESS(PORTWIN0PPS,2)
// PORTWIN0PPS<PORTWIN0PPS3>
extern volatile __bit                   PORTWIN0PPS3        __at(0x13EB);	// @ (0x27D * 8 + 3)
#define                                 PORTWIN0PPS3_bit    _BIT_ACCESS(PORTWIN0PPS,3)
// PORTWIN0PPS<PORTWIN0PPS4>
extern volatile __bit                   PORTWIN0PPS4        __at(0x13EC);	// @ (0x27D * 8 + 4)
#define                                 PORTWIN0PPS4_bit    _BIT_ACCESS(PORTWIN0PPS,4)
// PORTWIN0PPS<PORTWIN0PPS5>
extern volatile __bit                   PORTWIN0PPS5        __at(0x13ED);	// @ (0x27D * 8 + 5)
#define                                 PORTWIN0PPS5_bit    _BIT_ACCESS(PORTWIN0PPS,5)
// PORTWIN1PPS<PORTWIN1PPS0>
extern volatile __bit                   PORTWIN1PPS0        __at(0x13F0);	// @ (0x27E * 8 + 0)
#define                                 PORTWIN1PPS0_bit    _BIT_ACCESS(PORTWIN1PPS,0)
// PORTWIN1PPS<PORTWIN1PPS1>
extern volatile __bit                   PORTWIN1PPS1        __at(0x13F1);	// @ (0x27E * 8 + 1)
#define                                 PORTWIN1PPS1_bit    _BIT_ACCESS(PORTWIN1PPS,1)
// PORTWIN1PPS<PORTWIN1PPS2>
extern volatile __bit                   PORTWIN1PPS2        __at(0x13F2);	// @ (0x27E * 8 + 2)
#define                                 PORTWIN1PPS2_bit    _BIT_ACCESS(PORTWIN1PPS,2)
// PORTWIN1PPS<PORTWIN1PPS3>
extern volatile __bit                   PORTWIN1PPS3        __at(0x13F3);	// @ (0x27E * 8 + 3)
#define                                 PORTWIN1PPS3_bit    _BIT_ACCESS(PORTWIN1PPS,3)
// PORTWIN1PPS<PORTWIN1PPS4>
extern volatile __bit                   PORTWIN1PPS4        __at(0x13F4);	// @ (0x27E * 8 + 4)
#define                                 PORTWIN1PPS4_bit    _BIT_ACCESS(PORTWIN1PPS,4)
// PORTWIN1PPS<PORTWIN1PPS5>
extern volatile __bit                   PORTWIN1PPS5        __at(0x13F5);	// @ (0x27E * 8 + 5)
#define                                 PORTWIN1PPS5_bit    _BIT_ACCESS(PORTWIN1PPS,5)
// PMD6<PORTWMD>
extern volatile __bit                   PORTWMD             __at(0x340);	// @ (0x68 * 8 + 0)
#define                                 PORTWMD_bit         _BIT_ACCESS(PMD6,0)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x1FA7);	// @ (0x3F4 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x1000);	// @ (0x200 * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x1F88);	// @ (0x3F1 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x1F89);	// @ (0x3F1 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x1F92);	// @ (0x3F2 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x1F93);	// @ (0x3F2 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x1F94);	// @ (0x3F2 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x1F8A);	// @ (0x3F1 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x1F8B);	// @ (0x3F1 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x1F8C);	// @ (0x3F1 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x1F8D);	// @ (0x3F1 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x1F8E);	// @ (0x3F1 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x1F8F);	// @ (0x3F1 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x1F90);	// @ (0x3F2 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x1F91);	// @ (0x3F2 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0x1FC0);	// @ (0x3F8 * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0x1FC1);	// @ (0x3F8 * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0x1F40);	// @ (0x3E8 * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0x1F41);	// @ (0x3E8 * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0x1F4A);	// @ (0x3E9 * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0x1F4B);	// @ (0x3E9 * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0x1F4C);	// @ (0x3E9 * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0x1F4D);	// @ (0x3E9 * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0x1F4E);	// @ (0x3E9 * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0x1F4F);	// @ (0x3E9 * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0x1F42);	// @ (0x3E8 * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0x1F43);	// @ (0x3E8 * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0x1F44);	// @ (0x3E8 * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0x1F45);	// @ (0x3E8 * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0x1F46);	// @ (0x3E8 * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0x1F47);	// @ (0x3E8 * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0x1F48);	// @ (0x3E9 * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0x1F49);	// @ (0x3E9 * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// PRLOCK<PRLOCKED>
extern volatile __bit                   PRLOCKED            __at(0x5A0);	// @ (0xB4 * 8 + 0)
#define                                 PRLOCKED_bit        _BIT_ACCESS(PRLOCK,0)
// WDTPSL<PSCNT0>
extern volatile __bit                   PSCNT0              __at(0x3D0);	// @ (0x7A * 8 + 0)
#define                                 PSCNT0_bit          _BIT_ACCESS(WDTPSL,0)
// WDTPSL<PSCNT1>
extern volatile __bit                   PSCNT1              __at(0x3D1);	// @ (0x7A * 8 + 1)
#define                                 PSCNT1_bit          _BIT_ACCESS(WDTPSL,1)
// WDTPSH<PSCNT10>
extern volatile __bit                   PSCNT10             __at(0x3DA);	// @ (0x7B * 8 + 2)
#define                                 PSCNT10_bit         _BIT_ACCESS(WDTPSH,2)
// WDTPSH<PSCNT11>
extern volatile __bit                   PSCNT11             __at(0x3DB);	// @ (0x7B * 8 + 3)
#define                                 PSCNT11_bit         _BIT_ACCESS(WDTPSH,3)
// WDTPSH<PSCNT12>
extern volatile __bit                   PSCNT12             __at(0x3DC);	// @ (0x7B * 8 + 4)
#define                                 PSCNT12_bit         _BIT_ACCESS(WDTPSH,4)
// WDTPSH<PSCNT13>
extern volatile __bit                   PSCNT13             __at(0x3DD);	// @ (0x7B * 8 + 5)
#define                                 PSCNT13_bit         _BIT_ACCESS(WDTPSH,5)
// WDTPSH<PSCNT14>
extern volatile __bit                   PSCNT14             __at(0x3DE);	// @ (0x7B * 8 + 6)
#define                                 PSCNT14_bit         _BIT_ACCESS(WDTPSH,6)
// WDTPSH<PSCNT15>
extern volatile __bit                   PSCNT15             __at(0x3DF);	// @ (0x7B * 8 + 7)
#define                                 PSCNT15_bit         _BIT_ACCESS(WDTPSH,7)
// WDTTMR<PSCNT16>
extern volatile __bit                   PSCNT16             __at(0x3E0);	// @ (0x7C * 8 + 0)
#define                                 PSCNT16_bit         _BIT_ACCESS(WDTTMR,0)
// WDTTMR<PSCNT17>
extern volatile __bit                   PSCNT17             __at(0x3E1);	// @ (0x7C * 8 + 1)
#define                                 PSCNT17_bit         _BIT_ACCESS(WDTTMR,1)
// WDTPSL<PSCNT2>
extern volatile __bit                   PSCNT2              __at(0x3D2);	// @ (0x7A * 8 + 2)
#define                                 PSCNT2_bit          _BIT_ACCESS(WDTPSL,2)
// WDTPSL<PSCNT3>
extern volatile __bit                   PSCNT3              __at(0x3D3);	// @ (0x7A * 8 + 3)
#define                                 PSCNT3_bit          _BIT_ACCESS(WDTPSL,3)
// WDTPSL<PSCNT4>
extern volatile __bit                   PSCNT4              __at(0x3D4);	// @ (0x7A * 8 + 4)
#define                                 PSCNT4_bit          _BIT_ACCESS(WDTPSL,4)
// WDTPSL<PSCNT5>
extern volatile __bit                   PSCNT5              __at(0x3D5);	// @ (0x7A * 8 + 5)
#define                                 PSCNT5_bit          _BIT_ACCESS(WDTPSL,5)
// WDTPSL<PSCNT6>
extern volatile __bit                   PSCNT6              __at(0x3D6);	// @ (0x7A * 8 + 6)
#define                                 PSCNT6_bit          _BIT_ACCESS(WDTPSL,6)
// WDTPSL<PSCNT7>
extern volatile __bit                   PSCNT7              __at(0x3D7);	// @ (0x7A * 8 + 7)
#define                                 PSCNT7_bit          _BIT_ACCESS(WDTPSL,7)
// WDTPSH<PSCNT8>
extern volatile __bit                   PSCNT8              __at(0x3D8);	// @ (0x7B * 8 + 0)
#define                                 PSCNT8_bit          _BIT_ACCESS(WDTPSH,0)
// WDTPSH<PSCNT9>
extern volatile __bit                   PSCNT9              __at(0x3D9);	// @ (0x7B * 8 + 1)
#define                                 PSCNT9_bit          _BIT_ACCESS(WDTPSH,1)
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0x1FAF);	// @ (0x3F5 * 8 + 7)
#define                                 PSIS_bit            _BIT_ACCESS(ADCON2,7)
// DAC1CON<PSS0>
extern volatile __bit                   PSS0                __at(0x3FA);	// @ (0x7F * 8 + 2)
#define                                 PSS0_bit            _BIT_ACCESS(DAC1CON,2)
// DAC1CON<PSS1>
extern volatile __bit                   PSS1                __at(0x3FB);	// @ (0x7F * 8 + 3)
#define                                 PSS1_bit            _BIT_ACCESS(DAC1CON,3)
// PORTWDF<PWDF0>
extern volatile __bit                   PWDF0               __at(0x858);	// @ (0x10B * 8 + 0)
#define                                 PWDF0_bit           _BIT_ACCESS(PORTWDF,0)
// PORTWDF<PWDF1>
extern volatile __bit                   PWDF1               __at(0x859);	// @ (0x10B * 8 + 1)
#define                                 PWDF1_bit           _BIT_ACCESS(PORTWDF,1)
// PORTWDF<PWDF2>
extern volatile __bit                   PWDF2               __at(0x85A);	// @ (0x10B * 8 + 2)
#define                                 PWDF2_bit           _BIT_ACCESS(PORTWDF,2)
// PORTWDF<PWDF3>
extern volatile __bit                   PWDF3               __at(0x85B);	// @ (0x10B * 8 + 3)
#define                                 PWDF3_bit           _BIT_ACCESS(PORTWDF,3)
// PORTWDF<PWDF4>
extern volatile __bit                   PWDF4               __at(0x85C);	// @ (0x10B * 8 + 4)
#define                                 PWDF4_bit           _BIT_ACCESS(PORTWDF,4)
// PORTWDF<PWDF5>
extern volatile __bit                   PWDF5               __at(0x85D);	// @ (0x10B * 8 + 5)
#define                                 PWDF5_bit           _BIT_ACCESS(PORTWDF,5)
// PORTWDF<PWDF6>
extern volatile __bit                   PWDF6               __at(0x85E);	// @ (0x10B * 8 + 6)
#define                                 PWDF6_bit           _BIT_ACCESS(PORTWDF,6)
// PORTWDF<PWDF7>
extern volatile __bit                   PWDF7               __at(0x85F);	// @ (0x10B * 8 + 7)
#define                                 PWDF7_bit           _BIT_ACCESS(PORTWDF,7)
// PWM1ERSPPS<PWM1ERSPPS0>
extern volatile __bit                   PWM1ERSPPS0         __at(0x1288);	// @ (0x251 * 8 + 0)
#define                                 PWM1ERSPPS0_bit     _BIT_ACCESS(PWM1ERSPPS,0)
// PWM1ERSPPS<PWM1ERSPPS1>
extern volatile __bit                   PWM1ERSPPS1         __at(0x1289);	// @ (0x251 * 8 + 1)
#define                                 PWM1ERSPPS1_bit     _BIT_ACCESS(PWM1ERSPPS,1)
// PWM1ERSPPS<PWM1ERSPPS2>
extern volatile __bit                   PWM1ERSPPS2         __at(0x128A);	// @ (0x251 * 8 + 2)
#define                                 PWM1ERSPPS2_bit     _BIT_ACCESS(PWM1ERSPPS,2)
// PWM1ERSPPS<PWM1ERSPPS3>
extern volatile __bit                   PWM1ERSPPS3         __at(0x128B);	// @ (0x251 * 8 + 3)
#define                                 PWM1ERSPPS3_bit     _BIT_ACCESS(PWM1ERSPPS,3)
// PWM1ERSPPS<PWM1ERSPPS4>
extern volatile __bit                   PWM1ERSPPS4         __at(0x128C);	// @ (0x251 * 8 + 4)
#define                                 PWM1ERSPPS4_bit     _BIT_ACCESS(PWM1ERSPPS,4)
// PWM1ERSPPS<PWM1ERSPPS5>
extern volatile __bit                   PWM1ERSPPS5         __at(0x128D);	// @ (0x251 * 8 + 5)
#define                                 PWM1ERSPPS5_bit     _BIT_ACCESS(PWM1ERSPPS,5)
// PIE4<PWM1IE>
extern volatile __bit                   PWM1IE              __at(0x2577);	// @ (0x4AE * 8 + 7)
#define                                 PWM1IE_bit          _BIT_ACCESS(PIE4,7)
// PIR4<PWM1IF>
extern volatile __bit                   PWM1IF              __at(0x25D7);	// @ (0x4BA * 8 + 7)
#define                                 PWM1IF_bit          _BIT_ACCESS(PIR4,7)
// IPR4<PWM1IP>
extern volatile __bit                   PWM1IP              __at(0x2517);	// @ (0x4A2 * 8 + 7)
#define                                 PWM1IP_bit          _BIT_ACCESS(IPR4,7)
// PMD3<PWM1MD>
extern volatile __bit                   PWM1MD              __at(0x328);	// @ (0x65 * 8 + 0)
#define                                 PWM1MD_bit          _BIT_ACCESS(PMD3,0)
// PIE4<PWM1PIE>
extern volatile __bit                   PWM1PIE             __at(0x2576);	// @ (0x4AE * 8 + 6)
#define                                 PWM1PIE_bit         _BIT_ACCESS(PIE4,6)
// PIR4<PWM1PIF>
extern volatile __bit                   PWM1PIF             __at(0x25D6);	// @ (0x4BA * 8 + 6)
#define                                 PWM1PIF_bit         _BIT_ACCESS(PIR4,6)
// IPR4<PWM1PIP>
extern volatile __bit                   PWM1PIP             __at(0x2516);	// @ (0x4A2 * 8 + 6)
#define                                 PWM1PIP_bit         _BIT_ACCESS(IPR4,6)
// PWM2ERSPPS<PWM2ERSPPS0>
extern volatile __bit                   PWM2ERSPPS0         __at(0x1290);	// @ (0x252 * 8 + 0)
#define                                 PWM2ERSPPS0_bit     _BIT_ACCESS(PWM2ERSPPS,0)
// PWM2ERSPPS<PWM2ERSPPS1>
extern volatile __bit                   PWM2ERSPPS1         __at(0x1291);	// @ (0x252 * 8 + 1)
#define                                 PWM2ERSPPS1_bit     _BIT_ACCESS(PWM2ERSPPS,1)
// PWM2ERSPPS<PWM2ERSPPS2>
extern volatile __bit                   PWM2ERSPPS2         __at(0x1292);	// @ (0x252 * 8 + 2)
#define                                 PWM2ERSPPS2_bit     _BIT_ACCESS(PWM2ERSPPS,2)
// PWM2ERSPPS<PWM2ERSPPS3>
extern volatile __bit                   PWM2ERSPPS3         __at(0x1293);	// @ (0x252 * 8 + 3)
#define                                 PWM2ERSPPS3_bit     _BIT_ACCESS(PWM2ERSPPS,3)
// PWM2ERSPPS<PWM2ERSPPS4>
extern volatile __bit                   PWM2ERSPPS4         __at(0x1294);	// @ (0x252 * 8 + 4)
#define                                 PWM2ERSPPS4_bit     _BIT_ACCESS(PWM2ERSPPS,4)
// PWM2ERSPPS<PWM2ERSPPS5>
